{
    "7jsyqt": {
        "author_fullname": "t2_1w72",
        "author_name": "spez",
        "created_utc": 1513271415.0,
        "domain": "self.announcements",
        "gilded": 8,
        "gildings": {},
        "id": "7jsyqt",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 14526,
        "over_18": false,
        "permalink": "/r/announcements/comments/7jsyqt/the_fccs_vote_was_predictably_frustrating_but/",
        "score": 194096,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "Following today’s disappointing vote from the FCC, Alexis and I wanted to take the time to thank redditors for your incredible activism on this issue, and reassure you that we’re going to continue fighting for the free and open internet. \n\nOver the past few months, we have been floored by the energy and creativity redditors have displayed in the effort to save net neutrality. It was inspiring to witness [organic takeovers](https://www.reddit.com/r/blog/comments/7j8fkt/an_analysis_of_net_neutrality_activism_on_reddit/) of the front page \\(twice\\), read touching [stories](https://www.reddit.com/r/blog/comments/6mtgtp/we_need_your_voice_as_we_continue_the_fight_for/) about how net neutrality matters in users’ everyday lives, see bills about net neutrality [discussed on the front page](https://www.reddit.com/r/technology/comments/7j6kn4/congress_has_set_out_a_bill_to_stop_the_fcc/) \\(with over 100,000 upvotes and cross-posts to over 100 communities\\), and watch redditors exercise their voices as citizens in the [hundreds of thousands of calls](https://thenextweb.com/insider/2017/11/22/reddit-net-neutrality-fcc-protest/) they drove to Congress.\n\nIt is disappointing that the FCC Chairman plowed ahead with his planned repeal despite all of this [public concern](https://www.washingtonpost.com/news/the-switch/wp/2017/12/12/this-poll-gave-americans-a-detailed-case-for-and-against-the-fccs-net-neutrality-plan-the-reaction-among-republicans-was-striking/?hpid=hp_hp-cards_hp-card-technology%3Ahomepage%2Fcard&utm_term=.d11780a12cc2), not to mention the [objections expressed by his fellow commissioners](https://www.theverge.com/2017/12/12/16766324/fcc-commissioners-clyburn-rosenworcel-net-neutrality), [the FCC’s own CTO](https://www.politico.com/story/2017/12/13/net-neutrality-repeal-warning-eric-burger-fcc-259968), [more than a hundred members of Congress](https://doyle.house.gov/sites/doyle.house.gov/files/documents/20171213DoyleNDelayLtrAll.pdf), [dozens of senators, and the very builders of the modern internet](https://www.salon.com/2017/12/12/senators-internet-pioneers-pen-letters-to-fcc-asking-to-cancel-thursdays-net-neutrality-vote/). \n\nNevertheless, today’s vote is the beginning, not the end. While the fight to preserve net neutrality is going to be longer than we had hoped, this is far from over.\n\nMany of you have asked what comes next. We don’t exactly know yet, but it seems likely that the FCC’s decision will be challenged in court soon, and we would be supportive of that challenge. It’s also possible that Congress can decide to take up the cause and create strong, enforceable net neutrality rules that aren’t subject to the political winds at the FCC. Nevertheless, this will be a complex process that takes time.\n\nWhat is certain is that Reddit will continue to be involved in this issue in the way that we know best: seeking out every opportunity to amplify your voices and share them with those who have the power to make a difference. \n\nThis isn’t the outcome we wanted, but you should all be proud of the awareness you’ve created. Those who thought that they’d be able to quietly repeal net neutrality without anyone noticing or caring learned a thing or two, and we still may come out on top of this yet. We’ll keep you informed as things develop.\n\nu\\/arabscarab \\(Jessica, our head of policy\\) will also be in the comments to address your questions. \n\n—u\\/spez & u\\/kn0thing\n\nupdate: Please note the FCC is not united in this decision and find the dissenting statements from commissioners [Clyburn and Rosenworcel](https://www.theverge.com/2017/12/14/16776712/fcc-commissioners-democrat-statements-net-neutrality).\n\nupdate2 (9:55AM pst): While the vote has not technically happened, we decided to post after the two dissenting commissioners released their statements. However, the actual vote appears to be delayed for security reasons. We hope everyone is safe.\n\nupdate3 (10:13AM pst): The FCC votes to repeal 3–2.",
        "title": "The FCC’s vote was predictably frustrating, but we’re not done fighting for net neutrality.",
        "total_awards_received": 0,
        "upvote_ratio": 0.86,
        "url": "https://www.reddit.com/r/announcements/comments/7jsyqt/the_fccs_vote_was_predictably_frustrating_but/"
    },
    "8jzyb6": {
        "author_fullname": "t2_15za7q",
        "author_name": "arabscarab",
        "created_utc": 1526517171.0,
        "domain": "self.announcements",
        "gilded": 6,
        "gildings": {},
        "id": "8jzyb6",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 6150,
        "over_18": false,
        "permalink": "/r/announcements/comments/8jzyb6/update_we_won_the_net_neutrality_vote_in_the/",
        "score": 192572,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "We did it, Reddit! \n\nToday, [the US Senate voted 52\\-47](https://www.wired.com/story/senate-approves-measure-to-save-net-neutrality) to restore Net Neutrality! While this measure must now go through the House of Representatives and then the White House in order for the rules to be fully restored, this is still an incredibly important step in that process—one that could not have happened without all your phone calls, emails, and [other activism](https://redditblog.com/2017/12/11/an-analysis-of-net-neutrality-activism-on-reddit/). The [evidence](http://www.publicconsultation.org/wp-content/uploads/2018/04/Net_Neutrality_II_Slides_041818.pdf) is clear that Net Neutrality is important to Americans of both parties \\(or no party at all\\), and today’s vote demonstrated that our Senators are hearing us.\n\nWe’ve still got a way to go, but today’s vote has provided us with some incredible momentum and energy to keep fighting. \n\nWe’re going to keep working with you all on this in the coming months, but for now, we just wanted to say thanks!",
        "title": "Update: We won the Net Neutrality vote in the Senate!",
        "total_awards_received": 0,
        "upvote_ratio": 0.85,
        "url": "https://www.reddit.com/r/announcements/comments/8jzyb6/update_we_won_the_net_neutrality_vote_in_the/"
    },
    "80jsi9": {
        "author_fullname": "t2_15za7q",
        "author_name": "arabscarab",
        "created_utc": 1519707605.0,
        "domain": "self.announcements",
        "gilded": 6,
        "gildings": {},
        "id": "80jsi9",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 4668,
        "over_18": false,
        "permalink": "/r/announcements/comments/80jsi9/upvote_the_downvote_tell_congress_to_use_the_cra/",
        "score": 161930,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "Hey, Reddit! \n\nIt’s been a couple months since the FCC voted to repeal federal net neutrality regulations. We were all disappointed in the decision, but we told you we’d continue the fight, and we wanted to share an update on what you can do to help. \n\nThe debate has now moved to Congress, which is good news. Unlike the FCC, which is unelected and less immediately accountable to voters, members of Congress depend on input from their constituents to help inform their positions—especially during an election year like this one. \n\n“But wait,” you say. “I already called my Congressperson last year, and we’re still in this mess! What’s different now?” Three words: **Congressional Review Act.**\n\n# What is it?\n\nThe Congressional Review Act \\(CRA\\) is basically Congress’s downvote. It lets them undo the FCC’s order through a “resolution of disapproval.” This can be formally introduced in both the Senate and the House within 60 legislative days after the FCC’s order is officially published in the Federal Register, which happened last week. It needs a simple majority in both houses to pass. Our friends at Public Knowledge have made [a video explaining the process](https://youtu.be/VABCjxFtRnI).\n\n# What’s happening in Congress?\n\nNow that the FCC order has been published in the Federal Register, the clock for the CRA is ticking. Members of both the House and Senate who care about Net Neutrality have already been securing the votes they need to pass the resolution of disapproval. In fact, the Senate version is only [**#onemorevote**](https://www.battleforthenet.com/onemorevote/) away from the 51 it needs to pass! \n\n# What should I do?\n\nToday, we’re calling on you to phone your members of Congress and tell them what you think! You can see exactly where members stand on this issue so far on [this scoreboard](https://www.battleforthenet.com/scoreboard/). If they’re already on board with the CRA, great! Thank them for their efforts and tell them you appreciate it. Positive feedback for good work is important.\n\nIf they still need convincing, here is a script to help guide your conversation:\n\n“My name is \\_\\_\\_\\_\\_\\_\\_\\_ and I live in \\_\\_\\_\\_\\_\\_. I’m calling today to share my support for strong net neutrality rules. I’d like to ask Senator/Representative\\_\\_\\_\\_\\_\\_\\_ to use the CRA to pass a resolution of disapproval overturning the FCC’s repeal of net neutrality.”\n\n# Pro tips:\n\n\\-**Be polite**. That thing your grandma said about the flies and the honey and the vinegar is right. Remember, the people who disagree with us are the ones we need to convince. \n\n\\-**Only call the Senators and Representatives who actually represent YOU**. Calls are most effective when they come from actual constituents. If you’re not sure who represents you or how to get in touch with them, you can look it up [here](https://www.publicknowledge.org/act-now/tell-congress-to-use-the-cra-to-save-net-neutrality/#anchor).\n\n\\-**If this issue affects you personally because of who you are or what you do, let them know!** Local business owner who uses the web to reach customers? Caregiver who uses telemedicine to consult patients? Parent whose child needs the internet for school assignments? Share that. The more we can put a human face on this, the better.\n\n\\-**Don’t give up.** The nature of our democratic system means that things can be roundabout, messy, and take a long time to accomplish. Perseverance is key. We’ll be with you every step of the way.",
        "title": "Upvote the Downvote: Tell Congress to use the CRA to save net neutrality!",
        "total_awards_received": 0,
        "upvote_ratio": 0.81,
        "url": "https://www.reddit.com/r/announcements/comments/80jsi9/upvote_the_downvote_tell_congress_to_use_the_cra/"
    },
    "3cucye": {
        "author_fullname": "t2_i6i4",
        "author_name": "samaltman",
        "created_utc": 1436562890.0,
        "domain": "self.announcements",
        "gilded": 52,
        "gildings": {},
        "id": "3cucye",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 20022,
        "over_18": false,
        "permalink": "/r/announcements/comments/3cucye/an_old_team_at_reddit/",
        "score": 132252,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "Ellen Pao resigned from reddit today by mutual agreement.  I'm delighted to announce that Steve Huffman, founder and the original reddit CEO, is returning as CEO.\n \nWe are thankful for Ellen’s many contributions to reddit and the technology industry generally.  She brought focus to chaos, recruited a world-class team of executives, and drove growth.  She brought a face to reddit that changed perceptions, and is a pioneer for women in the tech industry.  She will remain as an advisor to the board through the end of 2015.  I look forward to seeing the great things she does beyond that.\n \nWe’re very happy to have Steve back.  Product and community are the two legs of reddit, and the board was very focused on finding a candidate who excels at both (truthfully, community is harder), which Steve does.  He has the added bonus of being a founder with ten years of reddit history in his head.  Steve is rejoining Alexis, who will work alongside Steve with the new title of “cofounder”.\n \nA few other points.  Mods, you are what makes reddit great.  The reddit team, now with Steve, wants to do more for you.  You deserve better moderation tools and better communication from the admins.\n \nSecond, redditors, you deserve clarity about what the content policy of reddit is going to be.  The team will create guidelines to both preserve the integrity of reddit and to maintain reddit as the place where the most open and honest conversations with the entire world can happen.\n\nThird, as a redditor, I’m particularly happy that Steve is so passionate about mobile.  I’m very excited to use reddit more on my phone.\n \nAs a closing note, it was sickening to see some of the things redditors wrote about Ellen. [1] The reduction in compassion that happens when we’re all behind computer screens is not good for the world.  People are still people even if there is Internet between you.\n\nIf the reddit community cannot learn to balance authenticity and compassion, it may be a great website but it will never be a truly great community.  Steve’s great challenge as CEO [2] will be continuing the work Ellen started to drive this forward.\n \n \n[1] Disagreements are fine.  Death threats are not, are not covered under free speech, and will continue to get offending users banned.\n\nEllen asked me to point out that the sweeping majority of redditors didn’t do this, and many were incredibly supportive. Although the incredible power of the Internet is the amplification of voices, unfortunately sometimes those voices are hateful.\n \n[2] We were planning to run a CEO search here and talked about how Steve (who we assumed was unavailable) was the benchmark candidate—he has exactly the combination of talent and vision we were looking for.  To our delight, it turned out our hypothetical benchmark candidate is the one actually taking the job.\n\n\nNOTE: I am going to let the reddit team answer questions here, and go do an AMA myself now.\n",
        "title": "An old team at reddit",
        "total_awards_received": 0,
        "upvote_ratio": 0.79,
        "url": "https://www.reddit.com/r/announcements/comments/3cucye/an_old_team_at_reddit/"
    },
    "8i3382": {
        "author_fullname": "t2_15za7q",
        "author_name": "arabscarab",
        "created_utc": 1525838618.0,
        "domain": "self.announcements",
        "gilded": 5,
        "gildings": {},
        "id": "8i3382",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 6016,
        "over_18": false,
        "permalink": "/r/announcements/comments/8i3382/orangered_alert_the_senate_is_about_to_vote_on/",
        "score": 108621,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "***TL;DR*** *–* [*Call your Senators*](https://www.senate.gov/general/contact_information/senators_cfm.cfm)*, then join us for an AMA with one.*\n\n***EDIT:*** [Senator Markey's AMA is live now.](https://www.reddit.com/r/politics/comments/8i7u5l/im_senator_ed_markey_and_im_forcing_a_vote_in_the/) \n\nHey Reddit, time for another update in the Net Neutrality fight!\n\nWhen we [last checked in](https://www.reddit.com/r/announcements/comments/80jsi9/upvote_the_downvote_tell_congress_to_use_the_cra/) on this in February, we told you about the [Congressional Review Act](https://www.theverge.com/2018/5/3/17314404/net-neutrality-cra-congressional-review-act-markey-senate), which allows Congress to undo the FCC’s repeal of Net Neutrality. That process took a big step forward today as the CRA petition was discharged in the Senate. That means a full Senate vote is likely soon, so let’s remind them that we’re watching!\n\n[Today, you’ll see sites across the web go on “RED ALERT”](https://www.commondreams.org/news/2018/05/03/red-alert-net-neutrality-gains-steam-internet-heavyweights-back-campaign) in honor of this cause. Because this is Reddit, we thought that [Orangered](https://www.urbandictionary.com/define.php?term=orangered) Alert was more fitting, but the call to action is the same. Join users across the web in [calling your Senators](https://www.senate.gov/general/contact_information/senators_cfm.cfm) \\(both of ‘em!\\) to let them know that you support using the Congressional Review Act to save Net Neutrality. You can learn more about the effort [here](https://netneutrality.internetassociation.org/action/).\n\nWe’re also delighted to share that Senator Ed Markey of Massachusetts, the lead sponsor of the CRA petition, will be joining us for an AMA in r/politics today at 2:30 pm ET, hot off the Senate floor, so get your questions ready!\n\nFinally, seeing [the creative ways the Reddit community gets involved](https://redditblog.com/2017/12/11/an-analysis-of-net-neutrality-activism-on-reddit/) in this issue is always the best part of these actions. Maybe you’re the mod of a community that has organized something in honor of the day. Or you want to share something really cool that your Senator’s office told you when you called them up. Or maybe you’ve made the dankest of net neutrality\\-themed memes. Let us know in the comments!\n\nThere is strength in numbers, and we’ve pulled off the impossible before through simple actions just like this. So let’s give those Senators a big, Reddit\\-y hug.\n\nhttps://preview.redd.it/0mi12vzs7rw01.jpg?width=299&format=pjpg&auto=webp&s=6e66a2a3d44936021717ff296795eef1311ab4ab",
        "title": "(Orange)Red Alert: The Senate is about to vote on whether to restore Net Neutrality",
        "total_awards_received": 0,
        "upvote_ratio": 0.79,
        "url": "https://www.reddit.com/r/announcements/comments/8i3382/orangered_alert_the_senate_is_about_to_vote_on/"
    },
    "mcisdf": {
        "author_fullname": "t2_1w72",
        "author_name": "spez",
        "created_utc": 1616625467.0,
        "domain": "self.announcements",
        "gilded": 10,
        "gildings": {},
        "id": "mcisdf",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 36087,
        "over_18": false,
        "permalink": "/r/announcements/comments/mcisdf/an_update_on_the_recent_issues_surrounding_a/",
        "score": 107366,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "We would like to give you all an update on the recent issues that have transpired concerning a specific Reddit employee, as well as provide you with context into actions that we took to prevent doxxing and harassment.\n\nAs of today, the employee in question is no longer employed by Reddit. We built a relationship with her first as a mod and then through her contractor work on RPAN. We did not adequately vet her background before formally hiring her. \n\nWe’ve put significant effort into improving how we handle doxxing and harassment, and this employee was the subject of both. In this case, we over-indexed on protection, which had serious consequences in terms of enforcement actions. \n\n* On March 9th, we added extra protections for this employee, including actioning content that mentioned the employee’s name or shared personal information on third-party sites, which we reserve for serious cases of harassment and doxxing.\n* On March 22nd, a news article about this employee was posted by a mod of r/ukpolitics. The article was removed and the submitter banned by the aforementioned rules. When contacted by the moderators of r/ukpolitics, we reviewed the actions, and reversed the ban on the moderator, and we informed the r/ukpolitics moderation team that we had restored the mod.\n* We updated our rules to flag potential harassment for human review.\n\nDebate and criticism have always been and always will be central to conversation on Reddit—including discussion about public figures and Reddit itself—as long as they are not used as vehicles for harassment. Mentioning a public figure’s name should not get you banned.\n\nWe care deeply for Reddit and appreciate that you do too. We understand the anger and confusion about these issues and their bigger implications. The employee is no longer with Reddit, and we’ll be evolving a number of relevant internal policies.\n\nWe did not operate to our own standards here. We will do our best to do better for you.",
        "title": "An update on the recent issues surrounding a Reddit employee",
        "total_awards_received": 0,
        "upvote_ratio": 0.63,
        "url": "https://www.reddit.com/r/announcements/comments/mcisdf/an_update_on_the_recent_issues_surrounding_a/"
    },
    "hrrh23": {
        "author_fullname": "t2_o30pnrf",
        "author_name": "LanterneRougeOG",
        "created_utc": 1594832829.0,
        "domain": "reddit.com",
        "gilded": 2,
        "gildings": {},
        "id": "hrrh23",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 4080,
        "over_18": false,
        "permalink": "/r/announcements/comments/hrrh23/now_you_can_make_posts_with_multiple_images/",
        "score": 87259,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": null,
        "title": "Now you can make posts with multiple images.",
        "total_awards_received": 0,
        "upvote_ratio": 0.88,
        "url": "https://www.reddit.com/gallery/hrrh23"
    },
    "e75f07": {
        "author_fullname": "t2_qromv",
        "author_name": "worstnerd",
        "created_utc": 1575670275.0,
        "domain": "self.redditsecurity",
        "gilded": 4,
        "gildings": {},
        "id": "e75f07",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3,
        "over_18": false,
        "permalink": "/r/announcements/comments/e75f07/suspected_campaign_from_russia_on_reddit/",
        "score": 76386,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": null,
        "title": "Suspected Campaign from Russia on Reddit",
        "total_awards_received": 0,
        "upvote_ratio": 0.84,
        "url": "https://www.reddit.com/r/redditsecurity/comments/e74nml/suspected_campaign_from_russia_on_reddit/"
    },
    "93qnm5": {
        "author_fullname": "t2_1wjm",
        "author_name": "KeyserSosa",
        "created_utc": 1533141992.0,
        "domain": "self.announcements",
        "gilded": 4,
        "gildings": {},
        "id": "93qnm5",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 7462,
        "over_18": false,
        "permalink": "/r/announcements/comments/93qnm5/we_had_a_security_incident_heres_what_you_need_to/",
        "score": 73264,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "**TL;DR**: A hacker broke into a few of Reddit’s systems and managed to access some user data, including some current email addresses and a 2007 database backup containing old salted and hashed passwords. Since then we’ve been conducting a painstaking investigation to figure out just what was accessed, and to improve our systems and processes to prevent this from happening again. \n\n**What happened?**\n\nOn June 19, we learned that between June 14 and June 18, an attacker compromised a few of our employees’ accounts with our cloud and source code hosting providers. Already having our primary access points for code and infrastructure behind strong authentication requiring two factor authentication (2FA), we learned that SMS-based authentication is not nearly as secure as we would hope, and the main attack was via SMS intercept.  We point this out to encourage everyone here to move to token-based 2FA. \n\nAlthough this was a serious attack, the attacker did not gain write access to Reddit systems; they gained read-only access to some systems that contained backup data, source code and other logs. They were not able to alter Reddit information, and we have taken steps since the event to further lock down and rotate all production secrets and API keys, and to enhance our logging and monitoring systems.\n\nNow that we've concluded our investigation sufficiently to understand the impact, we want to share what we know, how it may impact you, and what we've done to protect us and you from this kind of attack in the future.\n\n**What information was involved?**\n\nSince June 19, we’ve been working with cloud and source code hosting providers to get the best possible understanding of what data the attacker accessed. We want you to know about two key areas of user data that was accessed:\n\n* **All Reddit data from 2007 and before including account credentials and email addresses**\n   * *What was accessed:* A complete copy of an old database backup containing very early Reddit user data -- from the site’s launch in 2005 through May 2007. In Reddit’s first years it had many fewer features, so the most significant data contained in this backup are account credentials (username + salted *hashed* passwords), email addresses, and all content (mostly public, but also private messages) from way back then.\n   * *How to tell if your information was included:* We are sending a message to affected users and resetting passwords on accounts where the credentials might still be valid. If you signed up for Reddit after 2007, you’re clear here. Check your PMs and/or email inbox: we will be notifying you soon if you’ve been affected.\n* **Email digests sent by Reddit in June 2018**\n   * *What was accessed:* Logs containing the email digests we sent between June 3 and June 17, 2018. The logs contain the digest emails themselves -- they [look like this](https://i.redd.it/dtdpfncm6dd11.png). The digests connect a username to the associated email address and contain suggested posts from select popular and safe-for-work subreddits you subscribe to. \n   * *How to tell if your information was included:* If you don’t have an email address associated with your account or your “email digests” user preference was unchecked during that period, you’re not affected. Otherwise, search your email inbox for emails from [noreply@redditmail.com](mailto:noreply@redditmail.com) between June 3-17, 2018. \n\nAs the attacker had read access to our storage systems, other data was accessed such as Reddit source code, internal logs, configuration files and other employee workspace files, but these two areas are the most significant categories of user data.\n\n**What is Reddit doing about it?**\n\nSome highlights. We:\n\n* Reported the issue to law enforcement and are cooperating with their investigation.\n* Are messaging user accounts if there’s a chance the credentials taken reflect the account’s current password. \n* Took measures to guarantee that additional points of privileged access to Reddit’s systems are more secure (e.g., enhanced logging, more encryption and requiring token-based 2FA to gain entry since we suspect weaknesses inherent to SMS-based 2FA to be the root cause of this incident.)\n\n**What can you do?**\n\nFirst, check whether your data was included in either of the categories called out above by following the instructions there.\n\nIf your account credentials were affected and there’s a chance the credentials relate to the password you’re currently using on Reddit, we’ll make you reset your Reddit account password. Whether or not Reddit prompts you to change your password, think about whether you still use the password you used on Reddit 11 years ago on any other sites today. \n\nIf your email address was affected, think about whether there’s anything on your Reddit account that you wouldn’t want associated back to that address. You can find instructions on how to remove information from your account on this [help page](https://www.reddithelp.com/en/categories/using-reddit/your-reddit-account/removing-your-reddit-data).\n\nAnd, as in all things, a strong unique password and [enabling 2FA](https://www.reddithelp.com/en/categories/using-reddit/your-reddit-account/how-set-two-factor-authentication) (which we only provide via an authenticator app, not SMS) is recommended for all users, and be alert for potential phishing or scams.",
        "title": "We had a security incident. Here's what you need to know.",
        "total_awards_received": 0,
        "upvote_ratio": 0.85,
        "url": "https://www.reddit.com/r/announcements/comments/93qnm5/we_had_a_security_incident_heres_what_you_need_to/"
    },
    "fo7p5b": {
        "author_fullname": "t2_o30pnrf",
        "author_name": "LanterneRougeOG",
        "created_utc": 1585066228.0,
        "domain": "self.announcements",
        "gilded": 1,
        "gildings": {},
        "id": "fo7p5b",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3829,
        "over_18": false,
        "permalink": "/r/announcements/comments/fo7p5b/introducing_reddit_polls_an_allnew_post_type/",
        "score": 67903,
        "subreddit": "announcements",
        "subreddit_id": "2r0ij",
        "text": "If you’re looking for an opinion on anything — the most underrated TV show of the nineties; the very best drugstore mascara; the most athletic NFL player of all-time — there’s no better place to get honest answers and gauge consensus, than on Reddit.\n\nToday, in an effort to elevate Reddit’s diverse opinion-based content, we’re excited to introduce Polls: a brand new post type that encourages redditors to share their opinion via voting. We’ve been testing Polls with a dozen communities over the past couple months, and have gotten a lot of great feedback. We are excited to now release this post type to everyone!\n\n**Why Polls?**\n\nIt can sometimes be tough for new redditors and lurkers to know where to start on Reddit, , and to feel a sense of community. We believe a simple post type that reduces the posting barrier will make it easier than ever for everyone to contribute to their favorite communities and engage in different ways.\n\nHere’s a look at some of our recent test polls\n\n[Viewing the results of a poll on new Reddit](https://preview.redd.it/z45s3p889no41.png?width=2356&format=png&auto=webp&s=cbd040f5e79e93b503c0a2d61378470c478e2305)\n\n&#x200B;\n\n[Trunks...the people have spoken](https://preview.redd.it/ptccsbp89no41.png?width=1181&format=png&auto=webp&s=4c561ac017d3db3cfed95a49b5ec5dba5cc751d0)\n\n**Platform Support**\n\n* iOS: Supports poll creation and voting\n* Android: Supports poll creation and voting **(EDIT: there is a bug on old versions of Android that cause the app to crash for some redditors when they vote. Updating the app to the new version will fix it.)**\n* New Reddit (web): Supports poll creation and voting\n* Old Reddit (web): Does not support creation. At the bottom of a poll, redditors will see a link to view the poll. Clicking the link will open a new tab where they can view results and vote in the poll\n* Mobile web: Supports voting. No plans for poll creation support\n\nAnd now a poll...\n\n**With everything going on in the world, how are you feeling?**\n\n[View Poll](https://www.reddit.com/poll/fo7p5b)",
        "title": "Introducing Reddit Polls, An All-New Post Type",
        "total_awards_received": 0,
        "upvote_ratio": 0.77,
        "url": "https://www.reddit.com/r/announcements/comments/fo7p5b/introducing_reddit_polls_an_allnew_post_type/"
    }
}