{
    "7en6do": {
        "author_fullname": "t2_487e5",
        "author_name": "gheldean",
        "created_utc": 1511315327.0,
        "domain": "battleforthenet.com",
        "gilded": 1,
        "gildings": {},
        "id": "7en6do",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 2103,
        "over_18": false,
        "permalink": "/r/books/comments/7en6do/join_the_battle_for_net_neutrality_we_need_to/",
        "score": 180771,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "The internet has become an essential part of our daily lives and now it's under attack by big corporations like AT&T, Verizon, and Comcast. They want to create fast lanes for their own content and slow down everything else. This means that if you don't pay extra fees, you won't be able to access your favorite websites, ebooks, games, or any other content at full speed.\nThis is not only unfair but also dangerous for small businesses, innovation, and free speech. We need to protect net neutrality and ensure that everyone has equal access to the internet. The FCC is planning to vote on this issue on December 14th, so we have to act now and make our voices heard.\nSign up for the Battle for Net Neutrality and join millions of people who are fighting for a free and open internet. Let's stop these corporations from controlling what we see and",
        "title": "Join the Battle for Net Neutrality!! We need to stop them from allowing ISPs to charge us extra fees to access ebooks, games or anything else!",
        "total_awards_received": 0,
        "upvote_ratio": 0.86,
        "url": "https://www.battleforthenet.com/"
    },
    "i03qfx": {
        "author_fullname": "t2_ofpn4",
        "author_name": "i_love_anachronisms",
        "created_utc": 1596040494.0,
        "domain": "news.avclub.com",
        "gilded": 0,
        "gildings": {},
        "id": "i03qfx",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "spoilers in comments",
        "media_only": false,
        "num_comments": 5630,
        "over_18": false,
        "permalink": "/r/books/comments/i03qfx/its_july_29_2020_the_day_george_rr_martin_said_we/",
        "score": 108004,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "It's July 29, 2020, and George R.R. Martin has broken his promise to deliver the latest installment of A Song Of Ice And Fire, Winds Of Winter, by this date. In a now-infamous interview with The Guardian in 2016, Martin said that he would be willing to go to jail for his failure to complete the book on time.\n\"If I don't have Winds Of Winter done by July 29, 2020, then I will go to jail,\" Martin said at the time. \"I mean, I won't actually go to jail, but I will be shamed and humiliated and made into a laughingstock.\"\nBut despite the pressure from fans and the media alike, Martin has yet to deliver the highly anticipated novel. This has led many to wonder whether he will finally make good on his promise and",
        "title": "It's July 29, 2020, the day George R.R. Martin said we could imprison him if Winds Of Winter wasn't done",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://news.avclub.com/its-july-29-2020-the-day-george-r-r-martin-said-we-c-1844543284"
    },
    "b0mizy": {
        "author_fullname": "t2_5g1yj",
        "author_name": "SAT0725",
        "created_utc": 1552486701.0,
        "domain": "nbcnews.com",
        "gilded": 0,
        "gildings": {},
        "id": "b0mizy",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 2494,
        "over_18": false,
        "permalink": "/r/books/comments/b0mizy/amazon_removes_books_promoting_autism_cures_and/",
        "score": 80663,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "Amazon has removed several books from its website that promoted cures for autism and spread misinformation about vaccines.\nThe move was praised by medical experts who have long criticized the online retail giant for profiting off the sale of such books, which can cause harm to vulnerable communities.\n\"This is a significant step forward in combating the dangerous spread of anti-vaccination messaging and false information about autism treatments,\" said Dr. Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine.\n\"I'm hopeful that Amazon will continue to take action against those who promote pseudoscience and quackery.\"\nThe removed books include \"Healing the Symptoms Known as Autism,\" which claims to offer a natural cure for autism through dietary changes and supplements, and \"Vaccines on Trial,\" which argues that",
        "title": "Amazon removes books promoting autism cures and vaccine misinformation",
        "total_awards_received": 0,
        "upvote_ratio": 0.89,
        "url": "https://www.nbcnews.com/tech/internet/amazon-removes-books-promoting-autism-cures-vaccine-misinformation-n982576"
    },
    "fpcufi": {
        "author_fullname": "t2_41v32",
        "author_name": "Sariel007",
        "created_utc": 1585234485.0,
        "domain": "movieweb.com",
        "gilded": 1,
        "gildings": {},
        "id": "fpcufi",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 896,
        "over_18": false,
        "permalink": "/r/books/comments/fpcufi/reading_rainbow_host_levar_burton_wants_to_read/",
        "score": 71514,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "LeVar Burton has made it his mission to promote literacy and a love of reading in children, and now he's taking things one step further by offering free audiobooks to families. The Reading Rainbow host has teamed up with the online library service Audible to offer free audiobooks to families who may not have access to them otherwise.\nThe program is called \"Audible for Everyone\" and is designed to make listening to audiobooks more accessible to all families, regardless of their economic situation. Parents can sign up for the program on the Audible website and choose from over 200 titles that are appropriate for kids ages 3-12.\nBurton says that he believes that reading is essential for children's development and that it should be available to everyone. He also notes that listening to audiobooks can help kids improve their language skills and foster a love of learning.\nIn addition to this initiative,",
        "title": "‘Reading Rainbow’ Host LeVar Burton Wants to Read to Families for Free, Neil Gaiman Offers Entire Catalog",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://movieweb.com/levar-burton-read-to-families-free-book-catalog/"
    },
    "9nl70u": {
        "author_fullname": "t2_ssv9b",
        "author_name": "arickg",
        "created_utc": 1539357833.0,
        "domain": "washingtonpost.com",
        "gilded": 1,
        "gildings": {},
        "id": "9nl70u",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 1784,
        "over_18": false,
        "permalink": "/r/books/comments/9nl70u/incarcerated_pennsylvanians_now_have_to_pay_150/",
        "score": 68168,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "In Pennsylvania, inmates who want to read books or access educational materials must first pay for the privilege. A new policy requires those behind bars to spend up to $150 per year to read e-books, take online classes or use other forms of digital entertainment. This is a cruel and counterproductive move that punishes people who are already being punished by the criminal justice system. It's also part of a larger trend toward monetizing every aspect of incarceration, from phone calls to health care to basic necessities like toilet paper.\nThe idea that inmates should be forced to pay for their own imprisonment is deeply flawed. For one thing, it creates a financial barrier to education and rehabilitation, which can make it more difficult for people to successfully reenter society after they are released. It also perpetuates the idea that incarceration is primarily about punishment rather than re",
        "title": "Incarcerated Pennsylvanians now have to pay $150 to read. We should all be outraged.",
        "total_awards_received": 0,
        "upvote_ratio": 0.87,
        "url": "https://www.washingtonpost.com/amphtml/opinions/incarcerated-pennsylvanians-now-have-to-pay-150-to-read-we-should-all-be-outraged/2018/10/11/51f548b8-cbd9-11e8-a85c-0bbe30c19e8f_story.html"
    },
    "6z5ti8": {
        "author_fullname": "t2_8v0y6",
        "author_name": "szekeres81",
        "created_utc": 1505009932.0,
        "domain": "vulture.com",
        "gilded": 0,
        "gildings": {},
        "id": "6z5ti8",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 4519,
        "over_18": false,
        "permalink": "/r/books/comments/6z5ti8/stephen_king_briefly_talks_about_the/",
        "score": 66585,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "In a recent interview with Vulture, horror author Stephen King discussed the controversial orgy scene in his novel \"It,\" which was recently adapted into a hit movie. The scene depicts a group of young boys having sex with each other while wearing female clothing.\n\"I wasn't really thinking of anything in particular when I wrote it,\" said King. \"I just wanted to include some kind of sexual activity, because it's part of adolescence.\"\nKing went on to say that he believes the reason the scene has generated so much controversy is because it challenges traditional gender roles and sexuality.\n\"It's fascinating to me that there has been so much comment about that single sex scene and so little about the multiple child murders,\" he said. \"That must mean something, but I'm not sure what.\"\nThe author also addressed concerns that the scene could be interpreted as homophobic or",
        "title": "Stephen King briefly talks about the controversial orgy scene in the 'IT' novel. 'It’s fascinating to me that there has been so much comment about that single sex scene and so little about the multiple child murders. That must mean something, but I’m not sure what.'",
        "total_awards_received": 0,
        "upvote_ratio": 0.88,
        "url": "http://www.vulture.com/2017/09/stephen-king-statement-on-child-sex-in-novel-it.html"
    },
    "ie2sm4": {
        "author_fullname": "t2_3q4nl",
        "author_name": "whatatwit",
        "created_utc": 1598035979.0,
        "domain": "theguardian.com",
        "gilded": 0,
        "gildings": {},
        "id": "ie2sm4",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 1538,
        "over_18": false,
        "permalink": "/r/books/comments/ie2sm4/in_2018_jessica_johnson_wrote_an_orwell/",
        "score": 65649,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "Jessica Johnson, a former student of Ashton Sixth Form College in Manchester, England, has faced what can only be described as a Kafkaesque nightmare. After writing a prize-winning short story about an algorithm that decides school grades based on social class, she found herself in a situation eerily similar to the one she had imagined. Despite achieving top marks in her A-level English coursework, her final grade was downgraded by an automated system that took into account her performance in other subjects. As a result, she was not accepted for English at St. Andrews University, where she had hoped to study.\nJohnson's story, \"The Algorithm,\" won the George Orwell Prize for Political Fiction in 2018. It describes a dystopian future in which an algorithm determines students' grades based on their social class, with those from wealthy families receiving higher marks",
        "title": "In 2018 Jessica Johnson wrote an Orwell prize-winning short story about an algorithm that decides school grades according to social class. This year as a result of the pandemic her A-level English was downgraded by a similar algorithm and she was not accepted for English at St. Andrews University.",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://www.theguardian.com/education/2020/aug/18/ashton-a-level-student-predicted-results-fiasco-in-prize-winning-story-jessica-johnson-ashton"
    },
    "6ofsz0": {
        "author_fullname": "t2_kc20n",
        "author_name": "RebelFlightSuit",
        "created_utc": 1500552504.0,
        "domain": "npr.org",
        "gilded": 0,
        "gildings": {},
        "id": "6ofsz0",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 1138,
        "over_18": false,
        "permalink": "/r/books/comments/6ofsz0/kids_get_a_2_discount_if_they_read_a_book_aloud/",
        "score": 62907,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "In an effort to promote literacy and encourage parents to take an active role in their child's education, one barbershop in Flint, Michigan is offering kids a $2 discount on their haircuts - but there's a catch. To qualify for the discount, children must first read a book aloud to their barber while getting their hair cut.\nThe program, called \"Books and Barbers,\" was started by the owner of the Fuller Cut barbershop, Jamal Ingram, who wanted to find a way to help children in his community improve their reading skills. According to Ingram, many children in Flint struggle with reading, and he believes that encouraging them to read more often can help them succeed academically.\n\"I just want to be able to help these kids,\" Ingram told NPR. \"If I can do something to make a difference in their lives, then",
        "title": "Kids get a $2 discount if they read a book aloud to their barber while getting their haircut in Michigan",
        "total_awards_received": 0,
        "upvote_ratio": 0.88,
        "url": "http://www.npr.org/sections/ed/2016/10/12/496553810/choose-a-book-and-read-to-your-barber-hell-take-a-little-money-off-the-top?123"
    },
    "120h77a": {
        "author_fullname": "t2_8ctkkfpk",
        "author_name": "not-my-other-alt",
        "created_utc": 1679656664.0,
        "domain": "wgem.com",
        "gilded": 0,
        "gildings": {},
        "id": "120h77a",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 1311,
        "over_18": false,
        "permalink": "/r/books/comments/120h77a/illinois_house_passes_bill_prohibiting_book_bans/",
        "score": 62619,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "The Illinois House of Representatives has passed a bill that would prohibit public schools and libraries from banning books because of their content or viewpoint. The legislation, known as the \"Ban on Book Banning Bill,\" was introduced by State Rep. Will Guzzardi (D-Chicago) in response to reports of books being challenged or removed from school curriculums across the state.\n\"Books are powerful tools for learning and exploring new ideas,\" said Guzzardi. \"We should be promoting diverse perspectives and encouraging critical thinking in our classrooms and libraries, not restricting access to certain viewpoints.\"\nUnder the proposed law, schools and libraries could only remove books from their shelves if they were found to be obscene, pornographic, or otherwise illegal. Additionally, any attempts to ban a book would have to follow a specific process outlined in the bill, including written notification to parents and an opportunity for public comment",
        "title": "Illinois House passes bill prohibiting book bans",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "https://www.wgem.com/2023/03/23/illinois-house-passes-bill-prohibiting-book-bans/"
    },
    "77fqhe": {
        "author_fullname": "t2_u4wnz",
        "author_name": "JPTIII",
        "created_utc": 1508432216.0,
        "domain": "self.books",
        "gilded": 3,
        "gildings": {},
        "id": "77fqhe",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 1412,
        "over_18": false,
        "permalink": "/r/books/comments/77fqhe/the_fcc_is_expected_to_announce_a_vote_to_gut_net/",
        "score": 61637,
        "subreddit": "books",
        "subreddit_id": "2qh4i",
        "text": "Hey everyone, **the chairman of the FCC, is very likely to announce a vote to gut neutrality, possibly as soon as Nov. 22nd.** Once a vote is called, it will become much, much harder to stop ISPs from charging us extra fees to access sites like reddit, and controlling what we see and do online by throttling and blocking sites, apps, games, and streaming services. ISPs shouldn't be able to favor their own e-readers or online book services over others. the Internet is a massive public library. We cant allow the FCC to give Comcast control over it.\n\n**[But there’s still hope. The most effective way to can stop this is by driving as many calls as possible to our Senators and Representatives, now through Nov. 22nd. ](https://www.battleforthenet.com)**\n\nWe're getting word that there are lawmakers who are sympathetic to our cause and considering taking action to slow the FCC down, but they won’t act unless they get more phone calls from constituents. Also, if your think your Rep's opposed to net neutrality, its all the more reason to call them. Those Reps need to hear your voice more than anyone.\n\n**Please, head over to https://www.battleforthenet.com , and give your Senators and Reps a call telling them to stop the FCC from slashing Title II net neutrality protections.** The time to act is now.\n\nTo reach the call in line directly by phone, **call 202-930-8550**.\n\nWhen you get through to your Rep's office, introduce yourself, be polite, and say: \n> I support \"Title Two\" net neutrality rules and I urge you to oppose the FCC's plan to repeal them. Specifically, I'd like you to contact the FCC Chairman and demand he abandon his current plan.\n\nWe also have ready-made banners, modals, and graphics of various sizes here: https://www.battleforthenet.com/#join\n\nThanks.",
        "title": "The FCC is expected to announce a vote to gut net neutrality rules the day before Thanksgiving. Only a big burst of phone calls to Congress can stop them from allowing ISPs to charge us extra fees to access sites, apps, games, and ebooks.",
        "total_awards_received": 0,
        "upvote_ratio": 0.89,
        "url": "https://www.reddit.com/r/books/comments/77fqhe/the_fcc_is_expected_to_announce_a_vote_to_gut_net/"
    }
}