{
    "jptqj9": {
        "author_fullname": "t2_fkqop",
        "author_name": "throwawaynumber53",
        "created_utc": 1604766517.0,
        "domain": "apnews.com",
        "gilded": 263,
        "gildings": {},
        "id": "jptqj9",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 28395,
        "over_18": false,
        "permalink": "/r/news/comments/jptqj9/joe_biden_elected_president_of_the_united_states/",
        "score": 365125,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Joe Biden has been elected as the next President of the United States, defeating his Republican rival Donald Trump in a decisive victory. The former Vice President won with a clear majority in the Electoral College, securing at least 306 votes to Trump's 232.\nBiden's win was propelled by strong support from minority voters, particularly African Americans and Hispanics, who turned out in record numbers across key battleground states such as Florida, Georgia, and North Carolina.\nThe Democratic candidate also performed well among women and younger voters, who were drawn to his message of unity and progressivism. Biden promised to build on the Obama legacy and pursue policies that would address income inequality, climate change, and healthcare access.\nIn his victory speech, Biden thanked his supporters for their unwavering commitment and vowed to be a president \"for all Americans.\"",
        "title": "Joe Biden elected president of the United States",
        "total_awards_received": 0,
        "upvote_ratio": 0.88,
        "url": "https://apnews.com/article/election-2020-joe-biden-north-america-national-elections-elections-7200c2d4901d8e47f1302954685a737f"
    },
    "mv0fzt": {
        "author_fullname": "t2_f2jn1q3",
        "author_name": "Too_Hood_95",
        "created_utc": 1618952864.0,
        "domain": "kstp.com",
        "gilded": 65,
        "gildings": {},
        "id": "mv0fzt",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 27676,
        "over_18": false,
        "permalink": "/r/news/comments/mv0fzt/chauvin_found_guilty_of_murder_manslaughter_in/",
        "score": 250267,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "A former Minneapolis police officer was found guilty of murder and manslaughter Tuesday for the fatal shooting of George Floyd last year.\nDerek Chauvin was convicted on all three counts he faced: third-degree murder, second-degree manslaughter and intentional discharge of a firearm that endangers safety. He could face up to 25 years in prison for the murder charge alone.\nThe case has drawn national attention and sparked protests across the country as it was one of several high-profile cases involving police shootings of black men.\nFloyd, a 46-year-old black man, died May 25, 2019, after Chauvin and other officers responded to a call about a possible assault near a South Minneapolis intersection.\nChauvin shot Floyd nine times while he was handcuffed and lying on his st",
        "title": "Chauvin found guilty of murder, manslaughter in George Floyd's death",
        "total_awards_received": 0,
        "upvote_ratio": 0.8,
        "url": "https://kstp.com/news/former-minneapolis-police-officer-derek-chauvin-found-guilty-of-murder-manslaughter-in-george-floyd-death/6081181/?cat=1"
    },
    "j3oj21": {
        "author_fullname": "t2_9cl0t",
        "author_name": "hoosakiwi",
        "created_utc": 1601615057.0,
        "domain": "cnbc.com",
        "gilded": 230,
        "gildings": {},
        "id": "j3oj21",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "FLOTUS too",
        "media_only": false,
        "num_comments": 33329,
        "over_18": false,
        "permalink": "/r/news/comments/j3oj21/president_donald_trump_says_he_has_tested/",
        "score": 233315,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "President Donald Trump announced Friday that he has tested positive for the COVID-19 virus, making him the first sitting U.S. president to be diagnosed with the disease.\nIn a statement from the White House, Trump said he had been advised by his doctors to undergo testing after experiencing \"some symptoms\" related to the virus, including \"a little bit of a cough.\"\nThe president said he was not feeling ill and had no fever, but decided to get tested as a precautionary measure. The test came back positive for the virus.\nTrump said he would continue to monitor his health closely and follow all medical advice, including wearing a mask when necessary and taking any medication prescribed by his doctors.\nHe also urged Americans to continue following CDC guidelines and doing everything they can to slow the spread of the virus, which has sickened millions of people around the world and killed tens of",
        "title": "President Donald Trump says he has tested positive for coronavirus",
        "total_awards_received": 0,
        "upvote_ratio": 0.94,
        "url": "https://www.cnbc.com/2020/10/02/president-donald-trump-says-he-has-tested-positive-for-coronavirus.html"
    },
    "dfn3yi": {
        "author_fullname": "t2_167ibb",
        "author_name": "SageMo",
        "created_utc": 1570653917.0,
        "domain": "thedailybeast.com",
        "gilded": 15,
        "gildings": {},
        "id": "dfn3yi",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 9435,
        "over_18": false,
        "permalink": "/r/news/comments/dfn3yi/blizzard_employees_staged_a_walkout_after_the/",
        "score": 226335,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Blizzard employees staged a walkout on Tuesday to protest the company's decision to ban a professional gamer for expressing pro-Hong Kong views during a livestream.\nThe gamer, identified as \"Blitzchung,\" was banned from playing Hearthstone, a popular online card game developed by Blizzard, and had his prize money revoked after he expressed support for Hong Kong's pro-democracy movement during a post-match interview at the recent Grandmasters tournament in Taiwan.\nIn response, dozens of Blizzard employees walked out of their offices in protest, according to The Washington Post. Some reportedly wore yellow ribbons or held up signs supporting the Hong Kong protesters.\n\"We have a responsibility to protect our players and our community from any form of harassment, bullying or abuse,\" Blizzard said in a statement last week, defending its decision to",
        "title": "Blizzard Employees Staged a Walkout After the Company Banned a Gamer for Pro-Hong Kong Views",
        "total_awards_received": 0,
        "upvote_ratio": 0.97,
        "url": "https://www.thedailybeast.com/blizzard-employees-staged-a-walkout-to-protest-banned-pro-hong-kong-gamer"
    },
    "l18yys": {
        "author_fullname": "t2_13m39t",
        "author_name": "gumball_Jones",
        "created_utc": 1611148604.0,
        "domain": "edition.cnn.com",
        "gilded": 68,
        "gildings": {},
        "id": "l18yys",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 11684,
        "over_18": false,
        "permalink": "/r/news/comments/l18yys/trump_has_left_the_white_house_for_the_last_time/",
        "score": 222628,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "As the inauguration ceremony takes place, the former Vice President Joe Biden and Senator Kamala Harris have taken their oaths of office as President and Vice President respectively. The transfer of power from one administration to another was smooth and peaceful, marking a historic moment in American history.\nPresident Biden in his inaugural address promised to unite the country and work towards building a more inclusive America. He vowed to tackle the pressing issues facing the country, including the COVID-19 pandemic, climate change, and economic inequality.\nThe new President also paid tribute to the outgoing President, Donald Trump, saying that he had served the country with dedication and honor. However, he added that it was now time to move forward and build a better future for all Americans.\nMeanwhile, Senator Harris, who is the first woman and person of color to become Vice President, said that she was honored to serve alongside President Biden",
        "title": "Trump has left the White House for the last time as President",
        "total_awards_received": 0,
        "upvote_ratio": 0.82,
        "url": "https://edition.cnn.com/politics/live-news/biden-harris-inauguration-day-2021/h_3a1320a33c4bca4445d129010660144c"
    },
    "eubjfc": {
        "author_fullname": "t2_6eq99",
        "author_name": "headee",
        "created_utc": 1580067478.0,
        "domain": "fox5dc.com",
        "gilded": 19,
        "gildings": {},
        "id": "eubjfc",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 20201,
        "over_18": false,
        "permalink": "/r/news/comments/eubjfc/kobe_bryant_killed_in_helicopter_crash_in/",
        "score": 213684,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Tragic news has struck the world of sports as NBA legend Kobe Bryant was reportedly killed in a helicopter crash in Calabasas, California on Sunday morning. According to TMZ, Bryant was traveling with four other people in his private helicopter when it went down. There were no survivors.\nBryant, 41, is widely regarded as one of the greatest basketball players of all time. He played for the Los Angeles Lakers for 20 years before retiring in 2016. During his career, he won five NBA championships, two Olympic gold medals, and was named the league's MVP in 2008.\nThe cause of the crash is still unknown at this time. The National Transportation Safety Board has launched an investigation into the incident.",
        "title": "Kobe Bryant killed in helicopter crash in California",
        "total_awards_received": 0,
        "upvote_ratio": 0.91,
        "url": "https://www.fox5dc.com/news/kobe-bryant-killed-in-helicopter-crash-in-california-tmz-reports"
    },
    "jqfm3b": {
        "author_fullname": "t2_wnidd",
        "author_name": "Orange_fury",
        "created_utc": 1604856593.0,
        "domain": "abc13.com",
        "gilded": 8,
        "gildings": {},
        "id": "jqfm3b",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 5352,
        "over_18": false,
        "permalink": "/r/news/comments/jqfm3b/jeopardy_host_alex_trebek_dies_at_80_due_to/",
        "score": 200819,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Alex Trebek, the beloved host of the popular game show \"Jeopardy,\" has passed away at the age of 80 due to complications from pancreatic cancer.\nTrebek had been battling the disease since late 2019 and announced in March that he had undergone chemotherapy treatment for the third time. Despite his illness, he continued to host the show until just days before his death.\n\"It is with deep sadness that we announce the passing of our dear friend and colleague, Alex Trebek,\" said a statement released by Sony Pictures Television, which produces \"Jeopardy.\" \"His determination, wit, and presence will be missed by all who knew him and those who watched him.\"\nTrebek was born in Sudbury, Canada in 1940 and began his career as a television news anchor before transitioning into game show hosting in the 197",
        "title": "'Jeopardy' host Alex Trebek dies at 80 due to pancreatic cancer",
        "total_awards_received": 0,
        "upvote_ratio": 0.91,
        "url": "https://abc13.com/entertainment/jeopardy-host-alex-trebek-dies-at-80-due-to-pancreatic-cancer/7769962/"
    },
    "x96mla": {
        "author_fullname": "t2_s1hr8arw",
        "author_name": "LaloTwins",
        "created_utc": 1662658483.0,
        "domain": "bbc.co.uk",
        "gilded": 47,
        "gildings": {},
        "id": "x96mla",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 12807,
        "over_18": false,
        "permalink": "/r/news/comments/x96mla/queen_elizabeth_ii_has_died/",
        "score": 191428,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Queen Elizabeth II, the world's longest reigning monarch, has passed away at the age of 93. The news was announced by Buckingham Palace earlier today, stating that Her Majesty had peacefully passed away in her sleep.\nThe Queen had been suffering from a number of health issues in recent years, including arthritis and cataracts, but had remained in good spirits and continued to carry out royal engagements up until recently.\nThroughout her reign, Queen Elizabeth II oversaw significant changes in British society, including the legalization of same-sex marriage, the rise of social media and digital technology, and the shift towards more diverse representation in politics and the media.\nDespite these changes, the Queen remained a steadfast figurehead for the British people, embodying the values of duty, service, and resilience that have come to define Britain's national identity.\nPrince Charles, the Prince of",
        "title": "Queen Elizabeth II, has died",
        "total_awards_received": 0,
        "upvote_ratio": 0.79,
        "url": "https://www.bbc.co.uk/news/uk-61585886"
    },
    "84aebi": {
        "author_fullname": "t2_10knci",
        "author_name": "areallyshitusername",
        "created_utc": 1520999128.0,
        "domain": "news.sky.com",
        "gilded": 2,
        "gildings": {},
        "id": "84aebi",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 6816,
        "over_18": false,
        "permalink": "/r/news/comments/84aebi/scientist_stephen_hawking_has_died_aged_76/",
        "score": 188180,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Stephen Hawking, one of the world's most famous scientists, has died at the age of 76.\nThe physicist, who was born in Oxford and went on to become one of the most influential figures in his field, passed away peacefully at home in Cambridge.\nProfessor Hawking was known for his groundbreaking work on black holes and his book A Brief History Of Time, which sold millions of copies around the world.\nHe was diagnosed with motor neurone disease when he was just 22 years old and given only a few years to live, but defied doctors' expectations by living to see his 50th birthday and beyond.\nDespite being confined to a wheelchair and unable to speak due to his condition, Professor Hawking continued to write and lecture about his work, becoming a symbol of hope and inspiration for many people around the world.\nHis",
        "title": "Scientist Stephen Hawking has died aged 76",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "http://news.sky.com/story/scientist-stephen-hawking-has-died-aged-76-11289119"
    },
    "dp5lr1": {
        "author_fullname": "t2_3fddyio",
        "author_name": "purrgatory920",
        "created_utc": 1572436047.0,
        "domain": "foxnews.com",
        "gilded": 4,
        "gildings": {},
        "id": "dp5lr1",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 9895,
        "over_18": false,
        "permalink": "/r/news/comments/dp5lr1/jeffrey_epsteins_autopsy_more_consistent_with/",
        "score": 186244,
        "subreddit": "news",
        "subreddit_id": "2qh3l",
        "text": "Dr. Michael Baden, the forensic pathologist who observed Jeffrey Epstein’s autopsy, said Wednesday that the evidence he saw was more consistent with homicidal strangulation than suicide by hanging.\nBaden, who is also a Fox News contributor, told “The Ingraham Angle” host Laura Ingraham that based on his observations of Epstein’s neck and other injuries, he believed that the convicted sex offender may have been killed.\n“I think that the evidence points to murder,” Baden said. “There were signs of trauma in the neck area, including the thyroid cartilage and the cricoid cartilage.”\nBaden added that there were hemorrhages in Epstein’s eyes that suggested a struggle or a blow to the head. He also noted that Epstein had no broken bones or other injuries that would be consistent with falls from multiple",
        "title": "Jeffrey Epstein's autopsy more consistent with homicidal strangulation than suicide, Dr. Michael Baden reveals",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.foxnews.com/us/forensic-pathologist-jeffrey-epstein-homicide-suicide"
    }
}