{
    "l7afyx": {
        "author_fullname": "t2_wi0z0",
        "author_name": "hilbertthedog",
        "created_utc": 1611871714.0,
        "domain": "buzzfeednews.com",
        "gilded": 3,
        "gildings": {},
        "id": "l7afyx",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 4368,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/l7afyx/people_are_accusing_robinhood_of_stealing_from/",
        "score": 185671,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "On Tuesday, Robinhood Financial LLC, the popular investing app, announced that it would limit trading on shares of Gamestop Corporation, one of the world's largest gaming retailers. The reason given was to \"protect our customers\" from the volatility surrounding the stock. This decision has sparked outrage among many users who accuse Robinhood of stealing from the poor to give to the rich.\nThe controversy began when Wall Street analysts issued negative reports on Gamestop's future prospects, causing its share price to plummet. In response, short sellers began buying up large amounts of Gamestop shares in order to profit from the expected decline in value. These short selling strategies often involve borrowing shares and then selling them in the hopes of buying them back at a lower price.\nHowever, Robinhood's decision to limit trading on Gam",
        "title": "People Are Accusing Robinhood Of Stealing From The Poor To Give To The Rich After It Limited Trading On Gamestop Shares",
        "total_awards_received": 0,
        "upvote_ratio": 0.96,
        "url": "https://www.buzzfeednews.com/article/clarissajanlim/robinhood-gamestop-amc-stock-twitter-wall-street"
    },
    "gyzw2p": {
        "author_fullname": "t2_4mhxmloq",
        "author_name": "jigsawmap",
        "created_utc": 1591624957.0,
        "domain": "cbr.com",
        "gilded": 1,
        "gildings": {},
        "id": "gyzw2p",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 2837,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/gyzw2p/us_military_could_lose_space_force_trademark_to/",
        "score": 133855,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "The US military's newest branch, the Space Force, may have hit a snag in its efforts to establish itself as a legitimate military organization. According to reports, the United States Patent and Trademark Office (USPTO) has issued a preliminary ruling that could allow Netflix to claim ownership of the \"Space Force\" trademark for its upcoming comedy series starring actor Steve Carell.\nThe USPTO ruling states that the trademark application filed by the US Air Force on behalf of the Space Force is \"likely to cause confusion\" with the Netflix series, which is set to premiere later this year. The ruling cites similarities between the two marks and the fact that both parties are using the mark in connection with entertainment services.\nThe Air Force has until January 14th to respond to the USPTO's preliminary ruling. If it fails",
        "title": "US Military Could Lose Space Force Trademark to Netflix Series",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "https://www.cbr.com/us-military-lose-space-force-trademark-netflix/"
    },
    "so0ree": {
        "author_fullname": "[deleted]",
        "author_name": "[deleted]",
        "created_utc": 1644369840.0,
        "domain": "cityam.com",
        "gilded": 0,
        "gildings": {},
        "id": "so0ree",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3723,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/so0ree/metas_threat_to_close_down_facebook_and_instagram/",
        "score": 132102,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "Facebook CEO Mark Zuckerberg's recent threat to shut down Facebook and Instagram in Europe if the EU does not change its stance on privacy laws has backfired, with EU leaders embracing the idea of a social media shutdown.\nThe European Commissioner for Justice, Consumers and Gender Equality, Věra Jourová, said that life without social media would be \"very good\" and that people should take a break from it.\nShe told the BBC: \"If he is threatening to close down, well, then maybe it's time to look at alternatives. Maybe it's time to disconnect from social media, to have a bit more time for ourselves, to talk to each other face-to-face, to reflect.\"\nJourová added that while social media had some benefits, it also caused harm by spreading fake news and misinformation, promoting addiction and causing mental",
        "title": "Meta's threat to close down Facebook and Instagram in Europe backfires as EU leaders embrace shutdown: 'Life would be very good without'",
        "total_awards_received": 0,
        "upvote_ratio": 0.96,
        "url": "https://www.cityam.com/metas-threat-to-close-down-facebook-and-instagram-in-europe-backfires-as-eu-leaders-embrace-shutdown-life-would-be-very-good-without/"
    },
    "jrskag": {
        "author_fullname": "t2_4339waty",
        "author_name": "Durendal_1707",
        "created_utc": 1605039211.0,
        "domain": "americanindependent.com",
        "gilded": 2,
        "gildings": {},
        "id": "jrskag",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 4118,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/jrskag/white_house_threatens_to_fire_anyone_who_tries_to/",
        "score": 131106,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "The White House has issued a new policy threatening to fire any employee who attempts to resign or quit their job without first obtaining written permission from the President himself, Donald Trump. The policy was announced in a memo sent out by the White House Counsel's office on Tuesday and applies to all Executive Branch employees, including those working in the West Wing, the Vice President's office, and Cabinet-level agencies.\n\"Effective immediately, no Executive Branch employee shall submit a letter of resignation or request to terminate their employment with the federal government unless they have first obtained express written consent from the President,\" the memo states. \"Any employee who attempts to resign or quit their job without first obtaining such consent will be deemed to have committed a breach of contract and will be subject to immediate termination.\"\nThe memo goes on to say that the new policy is necessary to ensure that the government is able to maintain continu",
        "title": "White House threatens to fire anyone who tries to quit",
        "total_awards_received": 0,
        "upvote_ratio": 0.91,
        "url": "https://americanindependent.com/white-house-threatens-to-fire-anyone-who-tries-to-quit/"
    },
    "g6zci5": {
        "author_fullname": "t2_16vs7p",
        "author_name": "TheGiant1989",
        "created_utc": 1587691642.0,
        "domain": "cnn.com",
        "gilded": 0,
        "gildings": {},
        "id": "g6zci5",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 7020,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/g6zci5/dont_eat_or_inject_yourself_with_disinfectant/",
        "score": 129013,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "The US Food and Drug Administration (FDA) has issued a warning to the public not to ingest or inject themselves with disinfectants as a way of preventing or treating COVID-19.\nIn a statement released on Thursday, FDA Commissioner Stephen Hahn said that using disinfectants in this way is \"not only ineffective but also potentially harmful.\"\n\"There is no evidence that ingesting or injecting disinfectants provides any protective benefit against COVID-19,\" Dr. Hahn said. \"In fact, doing so can cause serious harm, including damage to your internal organs, and even death.\"\nDr. Hahn urged the public to follow recommended guidelines for preventing the spread of COVID-19, such as wearing masks, practicing social distancing, and washing hands frequently. He also advised people to seek medical attention if they experience sympt",
        "title": "Don't eat or inject yourself with disinfectant, warns FDA commissioner",
        "total_awards_received": 0,
        "upvote_ratio": 0.94,
        "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-23-20-intl/h_1d2d1c2779b624b151a1f72557aabe0d"
    },
    "qfozej": {
        "author_fullname": "t2_5n5x6",
        "author_name": "thebigdonkey",
        "created_utc": 1635191950.0,
        "domain": "whdh.com",
        "gilded": 1,
        "gildings": {},
        "id": "qfozej",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3319,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/qfozej/hiker_lost_on_mountain_for_24_hours_ignored_calls/",
        "score": 127003,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "A hiker who was lost on a mountain for 24 hours ignored calls from rescuers because he didn't recognize the phone number, according to officials. The 57-year-old man had set out on a hike in the White Mountains of New Hampshire but became disoriented and lost his way. He was able to call 911 for help but when rescue workers tried to reach him by phone, he didn't answer because he didn't recognize the number.\nRescue workers used drones and search dogs to locate the hiker, who was eventually found safe but exhausted. Officials say it's important for hikers to always carry a map and compass, and to let someone know where they are going and when they plan to return.",
        "title": "Hiker lost on mountain for 24 hours ignored calls from rescuers because he didn’t recognize phone number",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://whdh.com/news/hiker-lost-on-mountain-for-24-hours-ignored-calls-from-rescuers-because-he-didnt-recognize-phone-number/"
    },
    "gbirtf": {
        "author_fullname": "t2_4ak86",
        "author_name": "FenrirIII",
        "created_utc": 1588342211.0,
        "domain": "foxnews.com",
        "gilded": 2,
        "gildings": {},
        "id": "gbirtf",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3977,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/gbirtf/coronavirus_homeschooling_77_percent_of_parents/",
        "score": 120936,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "As the COVID-19 pandemic has forced millions of students to learn from home, many parents have found themselves in the role of teacher for the first time. And while they may not have the same training or experience as traditional educators, a new survey suggests that these at-home instructors are willing to advocate for better pay and working conditions for those who do.\nAccording to a recent poll conducted by The Harris Poll on behalf of the National Center for Education Statistics, 77 percent of parents who have been homeschooling their children due to the pandemic believe that teachers should be paid more for their work.\n\"It's clear from our research that parents who have taken on the responsibility of homeschooling their children during this crisis have gained a newfound appreciation for the hard work and dedication that goes into teaching,\" said NCES Commissioner Dr. Linda Murray. \"They recognize the value of having skilled professionals",
        "title": "Coronavirus homeschooling: 77 percent of parents agree teachers should be paid more after teaching own kids, study says",
        "total_awards_received": 0,
        "upvote_ratio": 0.91,
        "url": "https://www.foxnews.com/lifestyle/coronavirus-homeschool-parents-agree-teachers-paid-more-kids"
    },
    "aic7pm": {
        "author_fullname": "t2_yiutx",
        "author_name": "SpreadyGull",
        "created_utc": 1548090900.0,
        "domain": "wwltv.com",
        "gilded": 2,
        "gildings": {},
        "id": "aic7pm",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 2067,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/aic7pm/louisiana_eye_doctor_offers_free_eye_exams_for/",
        "score": 119949,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "A Louisiana ophthalmologist is offering free eye exams to all NFL referees in response to the controversial no-call during the Saints' playoff game against the Rams.\nDr. William Song of the Eye Associates of Baton Rouge said he was \"shocked and dismayed\" by the missed call, which could have won the game for the Saints.\n\"I'm a diehard Saints fan,\" Dr. Song told WWL-TV. \"It's time for us to come together as a community and do something positive.\"\nThe offer comes with one condition: Referees must promise to undergo laser eye surgery if they are found to have any visual impairment that could affect their ability to make accurate calls on the field.\n\"We want to ensure that these officials are seeing as clearly as possible so we can prevent another incident like this from happening again,\" Dr.",
        "title": "Louisiana eye doctor offers free eye exams for NFL referees after Saints loss",
        "total_awards_received": 0,
        "upvote_ratio": 0.94,
        "url": "https://www.wwltv.com/article/sports/nfl/saints/louisiana-eye-doctor-offers-free-eye-exams-for-nfl-referees-after-saints-loss/289-e2f3c314-1268-4708-8b5a-5ea445099589"
    },
    "jo0hzx": {
        "author_fullname": "t2_5v7yvvsd",
        "author_name": "ceylon_butterfly",
        "created_utc": 1604509784.0,
        "domain": "pazimbabwe.com",
        "gilded": 2,
        "gildings": {},
        "id": "jo0hzx",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 2699,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/jo0hzx/united_states_risks_sanctions_from_zimbabwe_if/",
        "score": 116843,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "The United States has warned that it will impose sanctions on Zimbabwe if the upcoming elections are not free and fair. In a statement, the US State Department said that it was closely monitoring the situation in Zimbabwe ahead of the July 30 election. The country's electoral commission has promised to deliver a credible vote, but opposition parties have raised concerns about voter suppression and intimidation.\n\nThe US government has already imposed targeted sanctions against senior officials in the ruling party, including President Emmerson Mnangagwa, for alleged human rights abuses. Secretary of State Mike Pompeo said that the US would continue to support the people of Zimbabwe in their struggle for freedom and democracy. He urged all parties to refrain from violence and intimidation during the election period.\n\nPresident Mnangagwa has promised to deliver a free",
        "title": "United States Risks Sanctions From Zimbabwe If Elections Are Not Free And Fair",
        "total_awards_received": 0,
        "upvote_ratio": 0.87,
        "url": "https://www.pazimbabwe.com/world-news-66406-united-states-risks-sanctions-from-zimbabwe-if-elections-are-not-free-and-fair.html"
    },
    "liqvh2": {
        "author_fullname": "t2_3xlnayi3",
        "author_name": "bubblydeadpan",
        "created_utc": 1613182336.0,
        "domain": "brokeassstuart.com",
        "gilded": 0,
        "gildings": {},
        "id": "liqvh2",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 3027,
        "over_18": false,
        "permalink": "/r/nottheonion/comments/liqvh2/doordash_spent_55_million_to_advertise_their_1/",
        "score": 115829,
        "subreddit": "nottheonion",
        "subreddit_id": "2qnts",
        "text": "DoorDash, the food delivery service, has been under fire for their tipping practices and the way they treat their drivers. In an effort to improve their image, they announced that they were donating $1 million to charities that support food insecurity and hunger relief. However, it's come to light that they spent $5.5 million on advertising the donation.\nThe company posted a video on Twitter featuring their CEO, Tony Xu, announcing the donation. The ad was broadcast during the Super Bowl and had a price tag of $5.5 million. The ad also featured a number of celebrities including actor Danny Trejo and NFL player DeAndre Hopkins.\nMany people have criticized the move as a PR stunt and have pointed out that the money could have been better spent actually helping those in need. Others have accused the company of using the donation to distract from the negative press they",
        "title": "DoorDash Spent $5.5 Million To Advertise Their $1 Million Charity Donation",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://brokeassstuart.com/2021/02/08/doordash-spent-5-5-million-to-advertise-their-1-million-charity-donation/"
    }
}