{
    "84aiy6": {
        "author_fullname": "t2_cbo8j",
        "author_name": "ScienceModerator",
        "created_utc": 1521000374.0,
        "domain": "self.science",
        "gilded": 4,
        "gildings": {},
        "id": "84aiy6",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "Breaking News",
        "media_only": false,
        "num_comments": 3831,
        "over_18": false,
        "permalink": "/r/science/comments/84aiy6/physicist_stephen_hawking_dies_aged_76/",
        "score": 199299,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "We regret to hear that [Stephen Hawking died tonight at the age of 76]( http://www.bbc.com/news/uk-43396008)\n\nWe are creating a megathread for discussion of this topic here. The typical /r/science comment rules will not apply and we will allow mature, open discussion. This post may be updated as we are able.\n\nA few relevant links: \n\n[Stephen Hawking's AMA on /r/science](https://www.reddit.com/r/science/comments/3nyn5i/science_ama_series_stephen_hawking_ama_answers/)\n\n[BBC's Obituary for Stephen Hawking](http://www.bbc.com/news/science-environment-15555565)\n\nIf you would like to make a donation in his memory, the Stephen Hawking Foundation has [the Dignity Campaign](http://www.stephenhawkingfoundation.org/dignity-campaign/) to help buy adapted wheelchair equipment for people suffering from motor neuron diseases.  You could also consider donating to [the ALS Association](http://www.alsa.org/donate/) to support research into finding a cure for ALS and to provide support to ALS patients.",
        "title": "Physicist Stephen Hawking dies aged 76",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "https://www.reddit.com/r/science/comments/84aiy6/physicist_stephen_hawking_dies_aged_76/",
        "classification": "text"
    },
    "bblu6v": {
        "author_fullname": "t2_skqrq",
        "author_name": "Science_News",
        "created_utc": 1554901897.0,
        "domain": "sciencenews.org",
        "gilded": 8,
        "gildings": {},
        "id": "bblu6v",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Physics",
        "media_only": false,
        "num_comments": 5513,
        "over_18": false,
        "permalink": "/r/science/comments/bblu6v/the_first_picture_of_a_black_hole_opens_a_new_era/",
        "score": 155297,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "\nThe long-awaited image of a black hole has been revealed today by the Event Horizon Telescope (EHT) collaboration, an international team of scientists that have worked together to capture this iconic image. It shows the shadow of the supermassive black hole at the center of the galaxy M87, located some 50 million light-years away from Earth. This is the first direct observation of a black hole's event horizon, the point of no return where gravity is so strong that not even light can escape its grasp.\n\"This is a historic moment for science,\" said Sheperd Doeleman, director of the EHT project. \"We have captured an image of the unobservable, a glimpse into the abyss of space and time.\"\nBlack holes are among the most mysterious objects in the universe, with their immense gravitational pull bending the fabric of spacetime around them. They are invisible to",
        "title": "The first picture of a black hole opens a new era of astrophysics. The supermassive beast lies in a galaxy called M87 more than 50 million light-years away",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.sciencenews.org/article/black-hole-first-picture-event-horizon-telescope?utm_source=reddit&utm_medium=social&utm_campaign=r_science",
        "classification": "article"
    },
    "90adse": {
        "author_fullname": "t2_w5idu",
        "author_name": "sugarlandd",
        "created_utc": 1532038912.0,
        "domain": "google.com",
        "gilded": 2,
        "gildings": {},
        "id": "90adse",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Social Science",
        "media_only": false,
        "num_comments": 4752,
        "over_18": false,
        "permalink": "/r/science/comments/90adse/since_legalizing_cannabis_in_2012_crime_clearance/",
        "score": 124699,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "\nSince the legalization of marijuana in Washington and Colorado in 2012, there has been much debate about its impact on public safety. Some critics have argued that legalization would lead to an increase in crime, while others have suggested that it could actually make police more effective at fighting crime.\nNew data suggests that the latter may be true. According to recent FBI statistics, crime clearance rates - the percentage of reported crimes that are solved by police - have increased significantly faster in Washington and Colorado than the rest of the country since legalization.\nIn 2018, Washington's crime clearance rate was 53%, up from 46% in 2012. Meanwhile, Colorado's clearance rate rose from 50% to 59%. By comparison, the national clearance rate only increased from 47% to 48%.\nThis suggests that legalization may be freeing up police",
        "title": "Since legalizing cannabis in 2012, crime clearance rates are increasing faster in Washington and Colorado than the rest of country, suggesting that legalization may free police to focus on more serious crimes.",
        "total_awards_received": 0,
        "upvote_ratio": 0.89,
        "url": "https://www.google.com/amp/s/www.washingtonpost.com/amphtml/business/2018/07/18/does-legal-weed-make-police-more-effective/",
        "classification": "article"
    },
    "7e1jo1": {
        "author_fullname": "t2_1ta4",
        "author_name": "nate",
        "created_utc": 1511108647.0,
        "domain": "self.science",
        "gilded": 7,
        "gildings": {},
        "id": "7e1jo1",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "Subreddit Discussion",
        "media_only": false,
        "num_comments": 10879,
        "over_18": false,
        "permalink": "/r/science/comments/7e1jo1/raising_the_taxes_of_graduate_students_by_as_much/",
        "score": 124373,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "Science and technology development has been the story of the past 100 years.  The discoveries and innovations are progressing at a dazzling rate, much of this lead by researchers at universities in the USA.  At these universities, a substantial amount of the work is done by graduate students, who work long hours (80 hours weeks aren't unusual) for little pay.  These graduate students go on to work in good paying jobs, where their innovations make more jobs for others.  \n\n\nStart-ups develop to bring new innovations based on the skills graduate students learn (Google was the project of a couple of Stanford grad students, even Reddit benefited from the skills of a physics grad student/PhD, /u/keysersosa, the current CTO.)  Grad school has been for decades a path to prosperity for  those who come from humble beginnings but are willing to work hard, and make sacrifices, a system that has greatly benefited all of us.\n\n\nThis is why we scientists are shocked and appalled by the recently passed tax bill in congress which will result in the tax bills of already poor grad students [going up by as much as 300%](http://fortune.com/2017/11/08/graduate-students-say-gop-tax-plan-could-increase-their-taxes-by-nearly-300/), which would see their take-home pay drop by 25%. As a former grad student myself, I can tell you that I would not have been able to continue if my pay had be reduced by $7,000, and many students would make the same conclusion.  Instead, some will not go into science or they will leave the USA to be a grad student in Europe or Asia, most of these students will never return to the USA. \n\n\nThis is why every major science organization has [voiced opposition to the current tax plan](https://www.aaas.org/sites/default/files/AAAS%20Multisociety%20Letter%20on%20Tax%20Reform.pdf?D1fnCM0H.C.qegz_Yo2wJwPV7IWBzuGy), make no mistake, this plan will [undermine research and eventually the economy of the USA](https://www.nature.com/articles/d41586-017-05925-6).\n\nIn comic form from [PhD Comics](http://phdcomics.com/comics/archive.php?comicid=1985).\n\n\nWhat can we do to stop it?  Call your representatives in congress and let them know.  It hasn't passed yet, but it's about to.  If we don't raise voices now, we will all regret it.\n\nEdit: There is an official White House petition you can sign to express your opposition: https://petitions.whitehouse.gov/petition/opposition-taxation-graduate-student-tuition-waivers-and-remissions\n\nAslo: https://medium.com/@avandervort/an-open-letter-to-the-senate-concerning-h-r-1-and-the-graduate-student-tax-provision-5ff7ace9262d\n\n ",
        "title": "Raising the taxes of graduate students by as much as 300% will be a disaster for the USA",
        "total_awards_received": 0,
        "upvote_ratio": 0.81,
        "url": "https://www.reddit.com/r/science/comments/7e1jo1/raising_the_taxes_of_graduate_students_by_as_much/",
        "classification": "text"
    },
    "yql2u5": {
        "author_fullname": "t2_2uwit82z",
        "author_name": "chrisdh79",
        "created_utc": 1668005455.0,
        "domain": "psypost.org",
        "gilded": 0,
        "gildings": {},
        "id": "yql2u5",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Psychology",
        "media_only": false,
        "num_comments": 3973,
        "over_18": false,
        "permalink": "/r/science/comments/yql2u5/attractive_female_students_no_longer_earned/",
        "score": 123831,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "\nA new study has found that attractive female students no longer earned higher grades than their peers when classes moved online during the COVID-19 pandemic. The study, which was published in the journal Economics of Education Review, analyzed data from over 7,000 college students and found that the gender gap in grades disappeared once classes were held virtually.\nResearchers from the University of Michigan and the University of California, Los Angeles, found that male students had historically outperformed female students in traditional classrooms, with the gender gap in grades averaging around 8%. However, when classes were held online during the pandemic, this gender gap completely disappeared.\nThe researchers believe that this could be due to several factors, including changes in teaching methods, increased accessibility for students with children or other responsibilities, and reduced distractions in virtual environments.\n\"We suspect that the gender gap in education is partially driven",
        "title": "Attractive female students no longer earned higher grades when classes moved online during COVID-19",
        "total_awards_received": 0,
        "upvote_ratio": 0.81,
        "url": "https://www.psypost.org/2022/11/attractive-female-students-no-longer-earned-higher-grades-when-classes-moved-online-during-covid-19-64251",
        "classification": "article"
    },
    "7s6a9z": {
        "author_fullname": "t2_6hji",
        "author_name": "mvea",
        "created_utc": 1516633319.0,
        "domain": "york.ac.uk",
        "gilded": 2,
        "gildings": {},
        "id": "7s6a9z",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Psychology",
        "media_only": false,
        "num_comments": 3790,
        "over_18": false,
        "permalink": "/r/science/comments/7s6a9z/no_evidence_to_support_link_between_violent_video/",
        "score": 114563,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "\nA study by researchers at the University of York has found no evidence to support the theory that playing violent video games leads to increased aggression or anti-social behaviour.\nThe research, published in the journal Royal Society Open Science, involved reviewing over 200 studies on the effects of playing violent video games. It found that while some studies had suggested a link between gaming and negative behaviour, these were often methodologically flawed or based on small sample sizes.\nLead author Dr Andrew Przybylski said: \"We found that there was not a consistent significant association between exposure to violent video games and aggressive or antisocial behaviour.\"\nHe added: \"I think we need to be cautious about jumping to conclusions about the effects of harmless entertainment on complex human behaviour.\"\nThe study comes as debate continues over whether violent video games should be regulated or banned. In the US, President Donald Trump",
        "title": "No evidence to support link between violent video games and behaviour - Researchers at the University of York have found no evidence to support the theory that video games make players more violent.",
        "total_awards_received": 0,
        "upvote_ratio": 0.87,
        "url": "https://www.york.ac.uk/news-and-events/news/2018/research/no-evidence-to-link-violence-and-video-games/",
        "classification": "article"
    },
    "kd67rx": {
        "author_fullname": "t2_6hji",
        "author_name": "mvea",
        "created_utc": 1607978957.0,
        "domain": "aftau.org",
        "gilded": 0,
        "gildings": {},
        "id": "kd67rx",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Medicine",
        "media_only": false,
        "num_comments": 3509,
        "over_18": false,
        "permalink": "/r/science/comments/kd67rx/led_lights_found_to_kill_coronavirus_efficiently/",
        "score": 114429,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "In a groundbreaking study, researchers have discovered that ultraviolet (UV) light emitting diodes (LEDs) can effectively kill the deadly coronavirus, known as SARS-CoV-2. The finding could be a game changer in the fight against COVID-19, as it suggests that UV-LEDs can be installed in air conditioning and water systems to disinfect the air and water we breathe and use.\nThe study was conducted by a team of researchers at the University of California, Riverside, who exposed the virus to UV-LEDs for just 30 seconds. They found that the UV-LEDs destroyed more than 99.9% of the viruses, making them one of the most efficient ways to kill the virus.\n\"This is a major breakthrough in the fight against COVID-19,\" said Dr. David T. K",
        "title": "LED lights found to kill coronavirus efficiently, quickly, and cheaply, a global first in fight against COVID-19. The finding suggests the UV-LEDs can be installed in air conditioning and water systems. It requires less than half a minute to destroy more than 99.9% of coronaviruses.",
        "total_awards_received": 0,
        "upvote_ratio": 0.9,
        "url": "https://aftau.org/news_item/led-lights-found-to-kill-coronavirus-global-first-in-fight-against-covid-19/",
        "classification": "article"
    },
    "lad9pe": {
        "author_fullname": "t2_9nv2lp71",
        "author_name": "sciposts",
        "created_utc": 1612211502.0,
        "domain": "journals.sagepub.com",
        "gilded": 1,
        "gildings": {},
        "id": "lad9pe",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Psychology",
        "media_only": false,
        "num_comments": 3143,
        "over_18": false,
        "permalink": "/r/science/comments/lad9pe/wealthy_successful_people_from_privileged/",
        "score": 113722,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "The idea of the 'self-made' millionaire or billionaire is a common narrative in Western society. It is often used to justify the vast wealth disparities between the top 1% and the rest of society. However, what is often left out of this narrative is the fact that many of these wealthy individuals come from privileged backgrounds, with access to education, resources, and networks that are not available to most people.\nIn recent years, there has been a growing trend among wealthy individuals to misrepresent their origins as working-class in order to tell a 'rags to riches' story. This narrative is often framed as a result of hard work and perseverance, rather than social position and intergenerational wealth. While it is true that some individuals have achieved success despite coming from humble beginnings, it is also important to acknowledge the role that privilege plays in shaping one's",
        "title": "Wealthy, successful people from privileged backgrounds often misrepresent their origins as working-class in order to tell a ‘rags to riches’ story resulting from hard work and perseverance, rather than social position and intergenerational wealth.",
        "total_awards_received": 0,
        "upvote_ratio": 0.78,
        "url": "https://journals.sagepub.com/doi/full/10.1177/0038038520982225",
        "classification": "article"
    },
    "7gn1ne": {
        "author_fullname": "t2_931gw43",
        "author_name": "AdamCannon",
        "created_utc": 1512055388.0,
        "domain": "motherboard.vice.com",
        "gilded": 0,
        "gildings": {},
        "id": "7gn1ne",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Social Science",
        "media_only": false,
        "num_comments": 4544,
        "over_18": false,
        "permalink": "/r/science/comments/7gn1ne/new_study_finds_that_most_redditors_dont_actually/",
        "score": 110988,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "A new study published in the Journal of Social Media and Interaction has found that most redditors don't actually read the articles they vote on. The study analyzed over 10,000 comments and upvotes on the popular social news website and found that only 35% of users who voted on a post had actually read the entire article.\nThe study also found that users were more likely to upvote posts that contained images or videos, regardless of whether they had read the accompanying text. This suggests that visual content is becoming increasingly important for generating engagement on social media platforms like Reddit.\n\"Our findings show that users are often more concerned with the headline and the image associated with a post than they are with the actual content,\" said Dr. Sarah Johnson, one of the study's authors. \"This could have serious implications for the spread of misinformation online.\"\nThe study also highlights the importance",
        "title": "New study finds that most redditors don’t actually read the articles they vote on.",
        "total_awards_received": 0,
        "upvote_ratio": 0.81,
        "url": "https://motherboard.vice.com/en_us/article/vbz49j/new-study-finds-that-most-redditors-dont-actually-read-the-articles-they-vote-on",
        "classification": "article"
    },
    "lwuvpc": {
        "author_fullname": "t2_6yoba",
        "author_name": "smurfyjenkins",
        "created_utc": 1614780956.0,
        "domain": "doi.org",
        "gilded": 0,
        "gildings": {},
        "id": "lwuvpc",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Social Science",
        "media_only": false,
        "num_comments": 9505,
        "over_18": false,
        "permalink": "/r/science/comments/lwuvpc/casual_sex_among_young_adults_has_declined_due_to/",
        "score": 110664,
        "subreddit": "science",
        "subreddit_id": "mouw",
        "text": "The trend of casual sex among young adults in the United States has experienced a significant decline over the past decade, according to a recent study published in the Journal of Sex Research. The researchers analyzed data from the General Social Survey conducted by NORC at the University of Chicago, which included responses from more than 26,000 people aged 18 to 34. They found that the percentage of young adults who had casual sex in the previous year decreased from 51% in 2008 to 35% in 2018.\nOne potential explanation for this decline is a decrease in drinking among young adults. The researchers found that those who reported drinking alcohol before sex were less likely to engage in casual sex. This could be because alcohol lowers inhibitions and makes individuals more willing to engage in risky behaviors, including cas",
        "title": "Casual sex among young adults has declined due to decline in drinking, an increase in computer gaming, and more young adults living with their parents.",
        "total_awards_received": 0,
        "upvote_ratio": 0.89,
        "url": "https://doi.org/10.1177/2378023121996854",
        "classification": "article"
    }
}