{
    "x35iu6": {
        "author_fullname": "t2_66dmt2zn",
        "author_name": "TylerLife",
        "created_utc": 1662032819.0,
        "domain": "self.tifu",
        "gilded": 29,
        "gildings": {},
        "id": "x35iu6",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "Fuck Up Of The Month",
        "media_only": false,
        "num_comments": 5003,
        "over_18": false,
        "permalink": "/r/tifu/comments/x35iu6/tifu_my_20f_girlfriend_of_two_years_told_me_the/",
        "score": 183758,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "\nA little back story; when I first started having sex I researched into ways to be better as I was a little stiff and pretty much had no idea what I was doing. I read online that you can play music and match the rhythm in order to put on a better performance.\n\nI searched love making songs and started slowly creating a playlist in which I was comfortable matching the rhythm.\n\nThere are a few songs to my playlist. However there is one song in particular, which actually happens to be my favourite, that my girlfriend hates and says turns her off in a major way. \n\nI don’t understand why it has taken her two years to tell me she hates that song, it’s a good love making song with good rhythm. I feel the way I fucked up is I could have possibly asked her previously if she likes the playlist or any songs she’d like to add/change. But to leave it for two years thinking our sex life is great but in her eyes has just been ruined by my music has left the whole situation feeling awkward and I’m a bit annoyed. \n\nI pretty much played this tune every single time so the amount of times she must have not been enjoying it, when I thought the complete opposite is annoying but also embarrassing in ways. \n\nNot to mention my previous partners, however they never complained about the song so maybe it’s just her?\n\nIt’s fucked up the relationship tbh because sex feels awkward now. The other day we were having sex with no music but I was still thrusting to the tune playing in my head. She recognised this and asked me to stop.  \n\nI thought this song was perfect and I always thrust along with the tune and feel it gives me the perfect rhythm for doing the deed to. I usually bust to this song and find it devastating she hates the song. \n\n[the song itself](https://youtu.be/KAwyWkksXuo)\n\nTL;DR She hates my love making tunes and didn’t tell me for over two years making sex now awkward.",
        "title": "TIFU / My (20F) girlfriend of two years told me the music that I (25M) play during sex is weird and a major turn off",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.reddit.com/r/tifu/comments/x35iu6/tifu_my_20f_girlfriend_of_two_years_told_me_the/",
        "classification": "text"
    },
    "a99fw9": {
        "author_fullname": "t2_j4fj9",
        "author_name": "Snorkels721",
        "created_utc": 1545690515.0,
        "domain": "self.tifu",
        "gilded": 17,
        "gildings": {},
        "id": "a99fw9",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "FUOTM",
        "media_only": false,
        "num_comments": 8842,
        "over_18": false,
        "permalink": "/r/tifu/comments/a99fw9/tifu_by_buying_everyone_an_ancestrydna_kit_and/",
        "score": 173984,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "Earlier this year, AncestryDNA had a sale on their kit. I thought it would be a great gift idea so I bought 6 of them for Christmas presents. Today my family got together to exchange presents for our Christmas Eve tradition, and I gave my mom, dad, brother, and 2 sisters each a kit. \n\nAs soon as everyone opened their gift at the same time, my mom started freaking out. She told us how she didn’t want us taking them because they had unsafe chemicals. We explained to her how there were actually no chemicals, but we could tell she was still flustered. Later she started trying to convince us that only one of us kids need to take it since we will all have the same results and to resell extra kits to save money. \n\nFast forward: Our parents have been fighting upstairs for the past hour, and we are downstairs trying to figure out who has a different dad. \n\nTL;DR I bought everyone in my family AncestryDNA kit for Christmas. My mom started freaking. Now our parents are fighting and my dad might not be my dad. \n\nUpdate:  Thank you so much for all the love and support. My sisters, brother and I have not yet decided yet if we are going to take the test. No matter what the results are, we will still love each other, and our parents no matter what. \n\nUpdate 2: CHRISTMAS ISN’T RUINED! My FU actually turned into a Christmas miracle. Turns out my sisters father passed away shortly after she was born. A good friend of my moms was able to help her through the darkest time in her life, and they went on to fall in love and create the rest of our family. They never told us because of how hard it was for my mom. Last night she was strong enough to share stories and photos with us for the first time, and it truly brought us even closer together as a family. This is a Christmas we will never forget. And yes, we are all excited to get our test results. Merry Christmas everyone!\n\nP.S. Sorry my mom isn’t a whore. No you’re not my daddy. ",
        "title": "TIFU by buying everyone an AncestryDNA kit and ruining Christmas",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.reddit.com/r/tifu/comments/a99fw9/tifu_by_buying_everyone_an_ancestrydna_kit_and/",
        "classification": "text"
    },
    "ak2k64": {
        "author_fullname": "t2_3jjsa",
        "author_name": "moby323",
        "created_utc": 1548521709.0,
        "domain": "self.tifu",
        "gilded": 5,
        "gildings": {},
        "id": "ak2k64",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "S",
        "media_only": false,
        "num_comments": 2567,
        "over_18": false,
        "permalink": "/r/tifu/comments/ak2k64/tifu_by_living_in_a_dark_bedroom_for_6_years/",
        "score": 148086,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "The overhead fan in our bedroom uses one of those compact halogen light bulbs. \n\n6 years ago the bulb burned out and got really dim, just barely a glow. I bought a replacement bulb but when I put that one in it was also barely lighting up so I realized the unit was bad.  \n\nThe fan still worked GREAT, it literally is the best fan I’ve ever had because it moves a ton of air and is super quiet. The fan had also been a gift when we moved into our house, the unit cost over $400 so I didn’t really want to replace it even though our bedroom doesn’t get much natural light so it is pretty dark. \n\n\nSo since then over the years my wife and I have had to make due with no overhead light. We open the windows during the day, and at night use a combination of bedside lamps and the bathroom light. It’s never really as good of lighting as an overhead lamp so I keep some flashlights up there for when we are cleaning or looking for something etc. \n\nAfter 6 years of living in the dark, this winter I just decided I would replace the damn thing. But before I did, I decided to try one last time with another bulb because, however unlikely, it’s possible BOTH bulbs I had tried were bad. \n\nSo I’m up there installing the new bulb, grab the remote (the fan has a remote) and as I’m turning the light on I realize:\n\nThe goddamn thing is dimmable. \n\n\nFor 6 fucking years we lived with the inconvenience of no overhead light and the whole time it was just because the damn thing was set to “dim”. \n\nFuck me. \n\nTL;DR\n\nFor 6 years I lived with no bedroom light because the overhead lamp was broken, but turns out it it was fine and it was just set to a dim setting the whole time. ",
        "title": "TIFU by living in a dark bedroom for 6 years.",
        "total_awards_received": 0,
        "upvote_ratio": 0.96,
        "url": "https://www.reddit.com/r/tifu/comments/ak2k64/tifu_by_living_in_a_dark_bedroom_for_6_years/",
        "classification": "text"
    },
    "bbgmzp": {
        "author_fullname": "t2_xgtog",
        "author_name": "Bufger",
        "created_utc": 1554862498.0,
        "domain": "self.tifu",
        "gilded": 71,
        "gildings": {},
        "id": "bbgmzp",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "S",
        "media_only": false,
        "num_comments": 3127,
        "over_18": false,
        "permalink": "/r/tifu/comments/bbgmzp/tifu_by_spending_the_last_year_on_reddit_talking/",
        "score": 143721,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "Today was the day I realised I messed up by not realising sooner and just thinking my content was shit \n\nFor the last 12 months I've been commenting on peoples posts, I've created my own posts. I haven't had a single upvote or reply to anything.. my karma has been at 885 for as long as I can remember so I just figured I wasnt very interesting (still likely true!)\n\nLast month I started to try and see my own posts through guest accounts and figured out they weren't showing, I could still clearly see my comments and posts on my account. \n\nAnyway, I finally mailed the help team and found out my IP was accidentally mixed in with some action to take out spammers, if you can see this it's all sorted now (and if you cant, I'm still in my own little Truman show)\n\nIf you're procrastinating (and let's face it, you are) feel free to go through my post history and verify the lack of any human engagement..\n\nTL;DR I was muted one year ago and didn't notice. Since then I've spent the whole time thinking how boring I must be because nobody replies  or updoots me.. :-/\n\nEdit: So I've gone from castaway to a full room of people handing me little arrows! Wilson and I thank you xx\n\nEdit 2: this is crazy! Thanks to everyone for all the jewels and things I know nothing about. I'll figure it out and pay it forwards! Special thanks to those that are answering my unanswered questions from previous posts - MVPs!\n\nPlease dont be too sad about this, i find it kind of funny that I've been such an idiot for so long. It's ok to laugh with/at me :)\n\nEdit 3: Reddit is awesome. I've missed you guys! Dont feel mad at the mods, its a tough and thankless job and flooders/bots are a real PITA. Its just one of those things and I thank them for putting in the hours.\n\nI also want to use this very brief soap box to raise awareness for mental health. Most of us here use Reddit as an escape, some people here have fewer friends irl than they do on the net. Make sure each other are ok every once in a while (if someone goes missing, like for more than a month....) - if you see someone struggling send them a message of support, even a stranger can help.\n\nI love all of you weirdos <3\n\nEdit 4: No more I promise. I'm completely overwhelmed by the response and the nice feedback. I'm trying to answer all of the questions but its difficult to keep up. I created an /AMA when this thread went down, if you relate to any of the topics close to me like diabetes, gaming, mental health, parenting etc then keep in touch. Heres a shameless pic of me with the best doggo in the world (and authentication for mods) - he listens to me even when you guys dont ;-) https://imgur.com/EgCbe6W\n\nStop giving me gold! I appreciate it but give to charity instead! Heres something different we could do <3\nhttps://www.reddit.com/r/Charity/comments/bbok3m/redditors_lets_do_something_different_for_charity/?utm_source=share&utm_medium=web2x",
        "title": "TIFU by spending the last year on reddit talking to myself after being muted.",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.reddit.com/r/tifu/comments/bbgmzp/tifu_by_spending_the_last_year_on_reddit_talking/",
        "classification": "text"
    },
    "i3xnlq": {
        "author_fullname": "t2_3e3evg7q",
        "author_name": "AgentPapier",
        "created_utc": 1596596919.0,
        "domain": "self.tifu",
        "gilded": 23,
        "gildings": {},
        "id": "i3xnlq",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "L",
        "media_only": false,
        "num_comments": 7095,
        "over_18": false,
        "permalink": "/r/tifu/comments/i3xnlq/tifu_by_owning_a_golden_retriever_while_being/",
        "score": 139829,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "Sigh. \n\nWork was rough today and all I wanted to do afterward was to sit on the couch and let the TV watch me while eating food not cooked by my own hands. The answer to that? Delivery. \n\nFood ordered, I let the dog into the yard to burn some energy and sat camped outside with him while waiting for the delivery. Doordash, Grubhub, Uber and everyone other than Jehovah's Witnesses has trouble locating my address strictly relying on GPS so it's nothing for me to post up and wait outside for when they are close, flag them down and go back inside for a contactless drop-off. \n\nPertinent details before shit hits the fan; my neighbor and I share a fence with a doggy door as our pups are super close and you can bet each time that if my dog is outside, hers will follow for cross-yard playtime. This was the case today and probably bad judgement on my part to think that I would be able to break up the fun quickly. \n\nBoth dogs were in the neighbor’s yard at the time the notification came through that the driver was pulling up and I had to call out a few times to get my dog’s attention. Neighbor thankfully whistled for her dog and I had to put on the ”voice” for mine to acknowledge I existed and then took off running for my door while waving to the driver who by this point was getting out of the car. \n\nPup and I have a game called Runaway where I will take off yelling ”RUNAWAY” and literally he will chase after me like some human sized fetch-stick. I use this to my advantage until he realized I was putting him inside but managed to get him through the storm door and close the screen before he could run out. Then realized that I'd left the gate locked like an idiot with the driver standing right outside by this point. \n\nI didn't have a mask on at this point and neither did she so I yelled from the porch that she could leave the food by the mailbox and that is where the fun started. \n\n”Is that your dog?”\n\nMy bullshit meter didn't go off. I thought she was asking a question with an obvious answer because duh, she was a dog person so I engaged with dog-owner gushiness. Yes; blah, blah, blah... His name is XYZ... Wanna say hi? \n\nI’ll be nice because you brought my food. \n\nBut she just stood there awkwardly for a moment, put the food down and quickly jumped back into her car. In my mind I was like, ”okay weird” but whatever. Snatched the food and went back inside. Went to wash my hands and from the kitchen window, I can see the full street where she is still parked outside. Thinking “okay weird...” again but didn’t dwell on it too much figuring that she was looking at the route to her next location. \n\nI went about my business of preparing to destroy my meal. Few minutes later, the dog begins barking manically at the door. I take a glance at the cameras and realize she is still out front parked directly in front of my mailbox. \n\nUh...ok? What’s going on here?\n\nI go outside and try to get her attention but she is on the phone and doesn’t notice me. I walk up like I’m going to check the mail and she does pull off, but towards the back of the neighborhood that only has one way in and one way out. Lots of people make that mistake and so you’ll quickly see cars turning back around but she never came back. By this time, I think I’m losing my mind so I go back in but still watching the street for the car to pass. It never does. \n\nI don’t know, people are weird so I just left it at that and went back to eat. About ten minutes later, dog starts going ham at the door so I check the cameras to see two police cars sitting outside my house. \n\nI continue to watch the cameras realizing that yup, the cops are getting out of the car and walking back and forth in front of mine and neighbor’s yards. I go out to see if anything is wrong and they introduce themselves before saying they were called because a stolen Golden Retriever was reported at my address and if there was a dog in the home. \n\nIt clicked that Driver had called the police and then explained my version of what happened. They were really respectful and apologetic but asked if I could get Sir Pup. I went ahead and opened the door for the dog who took off, ready to greet the new faces outside. His collar has tags matching the address with my name and phone number on it in case he was ever lost or stolen which was proof enough for them as it was obvious that they wanted to get this over as fast as possible. \n\nNo hard feelings on either side, we were all walking away when Driver’s car slowly comes creeping from the back of the neighborhood. I yelled out to them that the lady was right there and they positioned themselves in front of her car in a way she would have to stop and speak with them. \n\nI don’t know if this lady was drunk or off her meds but she rolled down the window and was literally sobbing hysterically that she saw me take the dog from the neighbor’s yard, that animals get no justice and the icing on the cake? MY KIND only owns Pittbulls and Rottweilers. There was no way he was mine and needed to be protected. I honestly did not want to deal with that mess so sorry guys, this isn’t a tale of revenge; I went back inside and stayed the fuck on my couch. My day was already shitty. Everyone left a few minutes after that so I assume she got a warning. \n\nHowever, I did report the incident to the delivery service and was offered credits towards my next meal. \n\nI splurged that on a bakery and now am currently fucking up a slice of carrot cake, grateful it didn’t end worse. \n\nTL; DR\n\nOrdered food, racist delivery person thought I stole my own Golden Retriever and had a breakdown when I didn’t get carted off in handcuffs. Didn’t get shot but got cake in the end.\n\nEdit: Wow, Reddit! Waking up to the massive amounts of love and well wishes was amazing! Thank you so much for your kind words! I am going to do my best and go through every comment and private message. I wish I could share this cake with all of you! Carrot cake lovers unite! Happy to share this pile of awards with other great posts and comments!\n\nTaking the sound advice to keep a close eye on the dog when he goes out. Will also share with neighbor just in case! My husband did agree with many of you to seek further action against the delivery driver but I’m pretty torn on whether to do so. Things are hard out here for all of us including the less savory members of our community but I will take the day to think on the next steps.\n\nI appreciate the sub this was posting to for restoring it after being removed. I apologize that this topic bent the rules and didn’t think 100% before submitting. This was a way to vent. Thank you for allowing this to be a place of dialogue!\n\nStay classy, everyone!",
        "title": "TIFU by owning a Golden Retriever while being Black.",
        "total_awards_received": 0,
        "upvote_ratio": 0.9,
        "url": "https://www.reddit.com/r/tifu/comments/i3xnlq/tifu_by_owning_a_golden_retriever_while_being/",
        "classification": "text"
    },
    "bpr2iy": {
        "author_fullname": "t2_2848qh05",
        "author_name": "Taway1234123491121",
        "created_utc": 1558098572.0,
        "domain": "self.tifu",
        "gilded": 30,
        "gildings": {},
        "id": "bpr2iy",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "FUOTM",
        "media_only": false,
        "num_comments": 15835,
        "over_18": false,
        "permalink": "/r/tifu/comments/bpr2iy/tifu_i_have_officially_branded_myself_as_the/",
        "score": 127642,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "This is his now ex-wife.\n\nDid he not realize, or too dumb to remember we share everything, including the same Reddit app? I logged on to see this throwaway as the default login account.\n\nI’ve removed all of this personal story for my family’s protection and changed this account’s password. Although it might be too late and already circulated online.\n\nI took a look through the comments and was seriously disgusted by most of the responses suggesting to sexually approach both of us last night. Which my sister did mention he tried something in the middle of the night, this guy is incredibly living in another world!\n\nI’m only posting this to reassure everyone thinking he got away with it, that these types of scumbags DO NOT.\n\nI came home yesterday with my sister to pack my shit. I saw his update saying I seemed alright, but I was keeping it in for the next morning.\n\nReason we slept in the living-room is because I didn’t want him to see my bags in the corner of the bedroom, he came home suddenly before I finished packing. It wasn’t “fun camping” or a “picnic”.\n\nThis morning, before he woke-up, we grabbed the rest of my stuff and left.\n\nI went to the bank and froze our joint account before he irresponsibly starts taking cash out.\n\nI’m not seeing him anymore, going to lawyer up, give away all this Reddit gold to the comments that I feel were actually reasonable, and divorce his ass.\n\nOh, and if you can read this, I’ve deleted the tracking app ;) my lawyer will call you to unfreeze your share and take the steps to unlink me from any other tracking apps you might have on me.\n\nTL;DR: His life is ruined.",
        "title": "TIFU: I have officially branded myself as the biggest perv... and I 100% deserve it...",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "https://www.reddit.com/r/tifu/comments/bpr2iy/tifu_i_have_officially_branded_myself_as_the/",
        "classification": "text"
    },
    "s3f513": {
        "author_fullname": "t2_165lzk",
        "author_name": "Moocow870",
        "created_utc": 1642122682.0,
        "domain": "self.tifu",
        "gilded": 10,
        "gildings": {},
        "id": "s3f513",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "S",
        "media_only": false,
        "num_comments": 3950,
        "over_18": false,
        "permalink": "/r/tifu/comments/s3f513/tifu_by_lying_to_my_wife_for_13_years/",
        "score": 127482,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "TIFU by lying to my wife for 13 years…\n\nMy wife hates orange and lime flavored candies. I love them. Well, love the orange, like the lime. \n\nSo, she passes on the orange starburst to me. She passes the orange and green skittles to me. She passes the orange and green gummy bears to me. This has been happening for 13 years. \n\nWhat she doesn’t know is that the green Haribo gummy bears are actually strawberry. \n\nShortly after we married, for one reason or another, I looked at the back of the Haribo gummy bears package and discovered this. \n\nSo I haven’t said anything for 13 years. Every time we get gummy bears, she gives me the orange and green (strawberry). I’ve never said a word. I’ve enjoyed eating my little lies. \n\nUntil last night…\n\nWe had some gummy bears and she opened them and she started to hand me the orange and green ones. But after a few minutes, I saw her looking at the back of the bag. Then I saw her eyes get REAL BIG. \n\nShe turned to me and asked if I’ve known that the green bears were strawberry. She always thought they were lime. \n\nI was honest and nodded my head yes. The look of betrayal was unreal…. She asked how long I’ve known, and I was honest. I told her as long as we’ve been married. \n\nShe quit giving me the gummy bears she didn’t like. She was even eating the orange ones out of spite. \n\nI don’t think I’ll get any more gummy bear discards after this. Time to buy my own.\n\nEdit: \n\nWe don’t eat these every day. A few times a year at most.\n\nI don’t just get the “rejects.” It’s a shared bag. Whenever she grabs a few, she would pick out the orange and green and hand to me. Just like I would give the pineapple to her (bleh). \n\n\nTL;DR I never corrected my wife by telling her she gave me strawberry gummy bears. She thought they were lime. Now she knows and is spite eating my favorites.",
        "title": "TIFU by lying to my wife for 13 years…",
        "total_awards_received": 0,
        "upvote_ratio": 0.91,
        "url": "https://www.reddit.com/r/tifu/comments/s3f513/tifu_by_lying_to_my_wife_for_13_years/",
        "classification": "text"
    },
    "6rr6ay": {
        "author_fullname": "t2_9gp6ege",
        "author_name": "coconutthrowaway69",
        "created_utc": 1501930566.0,
        "domain": "self.tifu",
        "gilded": 10,
        "gildings": {},
        "id": "6rr6ay",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "Fuck-Up of the Year",
        "media_only": false,
        "num_comments": 4216,
        "over_18": true,
        "permalink": "/r/tifu/comments/6rr6ay/tifu_by_cumming_into_a_coconut/",
        "score": 114574,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "EDIT: I got an AMA thread now. Help me: \n\nhttps://www.reddit.com/r/tifu/comments/6rwl9z/tifu_by_being_the_guy_who_cummed_into_a_coconut/?utm_content=title&utm_medium=new&utm_source=reddit&utm_name=tifu\n\n\nThis TIFU didn't happen today but quite a few years back. For obvious reasons I'm using a throwaway account as my family knows my main reddit username. \n\n-------------------------\n\nAnyway, around 8 years back I lived in Northern Mozambique, a coastal southern African country with quite a warm climate. My mother at the time was going through a 'health nut' phase and only buying foods she deemed healthy enough. One of these was coconuts. She would buy several coconuts a week to use in food from the local market.\n\n\nAnyway, being a horny teenager I fapped in regular intervals. Unfortunately there was some severely stressful examinations coming up for me and as such my fapping reached a higher peak then usual and I was feeling pretty sexually frustrated. One day I hear that my mother is going to be out for pretty much the entire afternoon. Horny me decides that it would be a fantastic idea to fuck a coconut. Honestly to this day I can't fathom why I thought that would be a good idea but my train of thought back then was clearly somewhat clogged. \n\n\nI end up grabbing the coconut drill and through 20ish minutes of *concerted* effort end up creating a hole large enough for me to stick my porker into. I decide it requires some lube and grab the nearest slippery thing (some butter) before shoving it into the coconut followed shortly by my meat. I fuck the coconut and it actually feels pretty damn good so I blow my load, shove the coconut under my bed and continue about my day. \n\n--------------------\n\nFor the next week the coconut is my saviour. Whenever I want to get off I simply take it out and fuck it in its *delightfully* tight hole made better each time by accumulating volumes of my semen and butter acting as a lubricant. It's heaven. Now before I continue I'd best mention that at the time our area was experiencing quite humid, muggy weather which exacerbated an already existing fly problem. Disgustingly fat, bloated flies were commonly found around our house and the exterminators couldn't really do anything because it was a localized area problem that would \"go away in the winter\". \n\n\nAbout a week and a bit after the initial coconut fuck (I had been using it pretty much every day since then) I begin to notice a few more flies than usual as well as an odd, unpleasant smell about my room. Must be the coconut right? So I decide that I'll fuck it once more before I throw it out and get a new one.\n\n\n**Worst mistake I have ever made.**\n\n\nYou see, the reason for the increased number of flies was that the coconut was evidently, in hindsight, a nearly perfect place to lay eggs. As I penetrate the coconut one last time I begin to feel a strange wriggling sensation. Puzzled, I pull my cock out to discover that it is COVERED in rotted and moldy butter and semen and *TEEMING WITH TINY FUCKING MAGGOTS*. They were wriggling all over my dick head and some were even trying to force their way up into my urethra. \n\n\nI screamed, and threw the coconut against the wall which made the situation worse by spilling the contents. Hours of vigorous cock scrubbing, vomiting, and cleaning the remnants were spent reflecting on what the fuck I was doing with my life. \n\n\n**Never again. NEVER AGAIN.**\n\n\nTL;DR Don't fuck coconuts.\n\n\n\nEDIT: Jesus this exploded. I'm glad my maggoty experience made some people laugh, because I sure cry everytime I think back to it.\n\nEDIT 2: RIP inbox\n\nEDIT 3: Thanks for the gold. It eases my shame a little. I'm thinking of doing an AMA for you more curious individuals. Maybe if the post hits 10K - it's quite uncomfortable to discuss though as the visceral memories come back\n\nEDIT 4: My shame has never been this large. 47.1K upvotes. My story of coconut fucking is now permanently etched into reddit's history. Lord save me.",
        "title": "TIFU by cumming into a coconut",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "https://www.reddit.com/r/tifu/comments/6rr6ay/tifu_by_cumming_into_a_coconut/",
        "classification": "text"
    },
    "dj95o8": {
        "author_fullname": "t2_o8r5j",
        "author_name": "filterface",
        "created_utc": 1571331176.0,
        "domain": "self.tifu",
        "gilded": 17,
        "gildings": {},
        "id": "dj95o8",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "M",
        "media_only": false,
        "num_comments": 11866,
        "over_18": false,
        "permalink": "/r/tifu/comments/dj95o8/tifu_by_wearing_a_shawl_which_ruined_my/",
        "score": 114503,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "Minor background: I am a pretty affectionate, and at times, effeminate, dude. I'm 6'2 and have a pretty \"tough-guy\" background in that I was in special forces a while ago, and my roommates all served as well, but I also have thin wrists and sit on my friends' laps and blow kisses to them and shit. I'm not gay, I just am me.\n\nSo while I was in a shop with a roommate a few weeks ago he saw these really cool shawls that we both couldn't get out of our heads; he returned last weekend to buy them and now we have these shawls. Mine makes me look like a Star Wars character and his looks like the Outlaw Josey Wales, these are seriously awesome shawls. The first night we wore them, everybody at the dive bar we went to (Re: dudes) thought they were awesome as well. Then this girl and her friend arrive on invite from Shawlbro, and they are seriously turned off by our sweet shawls. Like, acting pretty weird about them and making comments. Whatever. So I get a call from my GF, she's tired and wants to hang out at mine, and so I bid these mean girls and Shawlbro adieu and head home.\n\nI'm still wearing the shawl when my GF arrives and she's also really taken aback, she won't even kiss me until I take it off. We get do the deed and go to sleep, and the next morning she starts asking me if I'm gay. And she's really serious and aggressive about it. I tell her I'm not, that if I was I'd definitely know if by now, and she counters with her major evidence of the fact that I own a shawl. Anyway she gets weird and leaves, and then sends me a text later about how she's sorry and that she \"needs to think about what kind of man\" she wants, and then doesn't contact me for days. So yesterday I invite her out, she's stumbling over her words and talking about how she likes tough guys and how she grew up in the south and needs to get used to The Big City, but that she doesn't know this or that, and eventually I just tell her very politely to get fucked because I'm pretty insulted by this point. On the way back, now that I'm not directly in front of her, I get this long apologetic text from her but the crux of it is that yeah, she's just not that into me anymore because I wore a shawl.\n\nLater on, I tell Shawlbro about this, and he also had a blowout with the girl he was seeing over his shawl that very same night we went out.\n\nWe are both going to keep wearing the shawls though, they are warm.\n\nTl;dr: Me and my friend bought cursed shawls and now we are single.\n\n&#x200B;\n\nEdit:\n\nShe's a nice girl, she's just not pickin up what I'm puttin down. It's a silly thing to be mad about.\n\nAnd by popular demand: [It's shawl over for you hoes](https://imgur.com/a/XXCrcM5)\n\nEdit 2: [Shawlbro](https://imgur.com/a/ZvlS5N9)",
        "title": "TIFU by wearing a shawl, which ruined my relationship with my GF",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://www.reddit.com/r/tifu/comments/dj95o8/tifu_by_wearing_a_shawl_which_ruined_my/",
        "classification": "text"
    },
    "hjw6en": {
        "author_fullname": "t2_4md27d48",
        "author_name": "soundman1488",
        "created_utc": 1593693219.0,
        "domain": "self.tifu",
        "gilded": 1,
        "gildings": {},
        "id": "hjw6en",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": true,
        "is_video": false,
        "link_flair_text": "S",
        "media_only": false,
        "num_comments": 7303,
        "over_18": false,
        "permalink": "/r/tifu/comments/hjw6en/tifu_by_having_the_username_soundman1488_for_15/",
        "score": 114030,
        "subreddit": "tifu",
        "subreddit_id": "2to41",
        "text": "I found out here on Reddit that my username that I’ve used 15+ years all over the internet was connected to Nazis because of the 1488. They banned me on r/AskReddit for it.\n\nI posted about it on here and changed my name to r/NazisStoleMyBirthday\n\nr/AskReddit unbanned me.\n\nThis post blew up and got really popular. It got me a 3 day suspension from Reddit for circumventing my ban on r/AskReddit\n\nThis morning I found out that somehow this post got changed to contain a ton of really inappropriate racial and homophobic slurs along with threats of violence. This was not me. I have no idea how that happened.\n\nSome of you won’t believe this and I understand that. I would be skeptical myself if I were you. For what it’s worth, I would never say things that, much less think them. My intention was to simply share my story and it blew up way more than I thought it would. Some misguided soul thought it would be good to change the post and mess the whole thing up. I take responsibility for what happens on my account, but this statements were not made by me. Obviously they have upset a lot of people and I wish I could meet each of you face to face to apologize.\n\nThis was not a stunt to try and get karma or awards. Again, some won’t believe that and that’s ok.\n\nIf you care, you can look at my original post on r/Banned to see where I was trying to understand why my name was offensive. You can also look at my post and comment history on this account and my new one to see that this was very clearly not me.\n\nI’m sorry everyone. I think I’m done with Reddit entirely.",
        "title": "TIFU by having the username “Soundman1488” for 15+ years of being on the internet and been unknowingly identifying myself as a Nazi.",
        "total_awards_received": 0,
        "upvote_ratio": 0.92,
        "url": "https://www.reddit.com/r/tifu/comments/hjw6en/tifu_by_having_the_username_soundman1488_for_15/",
        "classification": "text"
    }
}