{
    "k4qide": {
        "author_fullname": "t2_2brvvn9o",
        "author_name": "stem12345679",
        "created_utc": 1606846532.0,
        "domain": "businessinsider.com",
        "gilded": 2,
        "gildings": {},
        "id": "k4qide",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 8403,
        "over_18": false,
        "permalink": "/r/worldnews/comments/k4qide/an_antigay_hungarian_politician_has_resigned/",
        "score": 204543,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "On November 30, Hungarian MEP Zsolt Semjén was found fleeing a 25-man orgy in Brussels through a window by Belgian police. The incident occurred at a private residence in the city's suburbs and involved men from various countries. According to reports, some of the participants were also underage.\nSemjén, who is known for his strict views on homosexuality, immediately resigned from his position as deputy prime minister and Minister for National Development in Hungary. He had previously been accused of using state funds to support his own political campaign and was currently facing corruption charges.\nThe news of Semjén's involvement in the orgy comes as a shock to many, especially those who know him for his anti-gay rhetoric. In 2014, he spoke out against same-sex marriage and adoption rights for gay couples, calling",
        "title": "An anti-gay Hungarian politician has resigned after being caught by police fleeing a 25-man orgy through a window",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://www.businessinsider.com/hungarian-mep-resigns-breaking-covid-rules-gay-orgy-brussels-2020-12",
        "classification": "article"
    },
    "eclwg9": {
        "author_fullname": "t2_du01v",
        "author_name": "MachoNachoTaco",
        "created_utc": 1576718615.0,
        "domain": "nytimes.com",
        "gilded": 94,
        "gildings": {},
        "id": "eclwg9",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Trump",
        "media_only": false,
        "num_comments": 20040,
        "over_18": false,
        "permalink": "/r/worldnews/comments/eclwg9/trump_impeached_for_abuse_of_power/",
        "score": 202901,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "President Donald J. Trump became the third president in United States history to be impeached by the House of Representatives on Wednesday, December 18, 2019, on charges of abusing his power and obstructing Congress's investigation into his dealings with Ukraine.\nThe vote was largely along party lines, with only one Republican joining Democrats in voting to impeach Trump. The articles of impeachment will now move to the Senate, where a trial is expected to begin early next year.\nTrump was accused of using his position as president to pressure Ukraine to investigate his political rival Joe Biden, while withholding military aid that had been approved by Congress. The president denied any wrongdoing but ultimately released the aid after a whistleblower complaint triggered an investigation by congressional committees.\nIn a statement, Speaker Nancy Pelosi said the House \"cannot ignore the constitutional duty to",
        "title": "Trump Impeached for Abuse of Power",
        "total_awards_received": 0,
        "upvote_ratio": 0.88,
        "url": "https://www.nytimes.com/interactive/2019/12/18/us/politics/trump-impeachment-vote.html",
        "classification": "article"
    },
    "t3pgaz": {
        "author_fullname": "t2_jlqpx",
        "author_name": "bichonista",
        "created_utc": 1646081118.0,
        "domain": "newsweek.com",
        "gilded": 0,
        "gildings": {},
        "id": "t3pgaz",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 6912,
        "over_18": false,
        "permalink": "/r/worldnews/comments/t3pgaz/vladimir_putins_black_belt_revoked_by/",
        "score": 200153,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "The International Taekwondo Federation (ITF) has revoked Russian President Vladimir Putin's black belt, citing \"political interference\" in the sport and his government's alleged involvement in the doping scandal that led to the banning of Russian athletes from international competitions.\nIn a statement released on Wednesday, ITF President Chang Ung said that the decision was made after careful consideration of Mr. Putin's role in undermining the integrity of the sport and disregarding its rules and values.\nMr. Putin, who holds a fourth-degree black belt in taekwondo, has been accused of using his position as president to promote his own interests in the sport and to influence the outcome of major competitions. He has also been criticized for his government's alleged role in covering up the use of performance-enhancing drugs by Russian athletes, including",
        "title": "Vladimir Putin's black belt revoked by international taekwondo organization",
        "total_awards_received": 0,
        "upvote_ratio": 0.89,
        "url": "https://www.newsweek.com/vladimir-putins-black-belt-revoked-international-taekwondo-organization-1683304",
        "classification": "article"
    },
    "901p5f": {
        "author_fullname": "t2_612zd",
        "author_name": "DoremusJessup",
        "created_utc": 1531965995.0,
        "domain": "nytimes.com",
        "gilded": 77,
        "gildings": {},
        "id": "901p5f",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 18017,
        "over_18": false,
        "permalink": "/r/worldnews/comments/901p5f/two_weeks_before_his_inauguration_donald_j_trump/",
        "score": 189349,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "On Jan. 6, 2017, the heads of the United States's spy agencies, including the CIA director, James B. Comey; the FBI director, James S. Baker; and the director of national intelligence, James R. Clapper Jr., presented their findings on Russian interference in the 2016 presidential election to President Barack Obama and President-elect Donald J. Trump in a briefing at Trump Tower in New York City. The report concluded that Mr. Putin had personally ordered a complex cyberattack to sway the election in favor of Mr. Trump.\nThe report also included a summary of the evidence that the Russians had hacked into Democratic Party computer systems and stolen emails from Hillary Clinton's campaign chairman, John D. Podesta. This information was then disseminated through online platforms such as WikiLeaks and DCLeaks,",
        "title": "Two weeks before his inauguration, Donald J. Trump was shown highly classified intelligence indicating that President Vladimir V. Putin of Russia had personally ordered complex cyberattacks to sway the 2016 American election",
        "total_awards_received": 0,
        "upvote_ratio": 0.84,
        "url": "https://www.nytimes.com/2018/07/18/world/europe/trump-intelligence-russian-election-meddling-.html?hp&action=click&pgtype=Homepage&clickSource=story-heading&module=a-lede-package-region&region=top-news&WT.nav=top-news",
        "classification": "article"
    },
    "x96k3v": {
        "author_fullname": "t2_etf58",
        "author_name": "pipsdontsqueak",
        "created_utc": 1662658326.0,
        "domain": "bbc.co.uk",
        "gilded": 2,
        "gildings": {},
        "id": "x96k3v",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 16507,
        "over_18": false,
        "permalink": "/r/worldnews/comments/x96k3v/queen_elizabeth_ii_has_died_buckingham_palace/",
        "score": 189020,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "Queen Elizabeth II has passed away at the age of 93, Buckingham Palace has announced. The palace said in a statement that the Queen had passed away peacefully in her sleep at Windsor Castle earlier today.\nThe news was confirmed by the Queen's private secretary Sir Edward Young, who said in a statement: \"It is with great sadness that we must announce that Her Majesty Queen Elizabeth II has passed away peacefully in her sleep at Windsor Castle this morning. The Queen died surrounded by family and friends.\"\nSir Edward added that the Queen's son, Prince Charles, had been informed of his mother's death and would be taking over as King of England. The Prince of Wales is currently at Highgrove House in Gloucestershire, where he will remain until further notice.\nPrime Minister Boris Johnson expressed his condolences to the Royal Family and said that the country had lost \"a beloved figurehead",
        "title": "Queen Elizabeth II has died, Buckingham Palace announces",
        "total_awards_received": 0,
        "upvote_ratio": 0.79,
        "url": "https://www.bbc.co.uk/news/uk-61585886",
        "classification": "article"
    },
    "t0b6fb": {
        "author_fullname": "t2_dxxgyaai",
        "author_name": "geiwne",
        "created_utc": 1645709683.0,
        "domain": "dailymail.co.uk",
        "gilded": 5,
        "gildings": {},
        "id": "t0b6fb",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Russia/Ukraine",
        "media_only": false,
        "num_comments": 7683,
        "over_18": false,
        "permalink": "/r/worldnews/comments/t0b6fb/more_than_150_senior_russian_officials_sign_open/",
        "score": 178007,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "As tensions continue to escalate between Russia and Ukraine, more than 150 senior Russian officials have signed an open letter condemning President Vladimir Putin's decision to invade the former Soviet republic.\nThe letter, which was published on Monday, describes Putin's actions as 'an unprecedented atrocity' that could lead to 'catastrophic consequences.'\nThe group of academics, writers, and artists also warned against the dangers of nationalism and urged citizens 'not to participate' in any military campaign or 'to support it with their work.'\n'This is not our war,' they wrote in the letter, which was posted on the website Meduza. 'We do not believe that this is a just war, and we do not support it.'\nThe letter comes amid growing concerns over the conflict in Ukraine, where Russian forces have seized control of several cities and towns in the Crimea region",
        "title": "More than 150 senior Russian officials sign open letter condemning Putin's invasion of Ukraine as 'an unprecedented atrocity' and warn of 'catastrophic consequences' while urging citizens 'not to participate'",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://www.dailymail.co.uk/news/article-10546799/More-150-senior-Russian-officials-sign-open-letter-condemning-Putins-invasion-Ukraine.html?ito=rss-flipboard",
        "classification": "article"
    },
    "t1o8wq": {
        "author_fullname": "t2_dv4dbh7f",
        "author_name": "CyberArtillery",
        "created_utc": 1645850441.0,
        "domain": "timesofisrael.com",
        "gilded": 7,
        "gildings": {},
        "id": "t1o8wq",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "",
        "media_only": false,
        "num_comments": 8235,
        "over_18": false,
        "permalink": "/r/worldnews/comments/t1o8wq/rejecting_us_evacuation_offer_zelensky_says_i/",
        "score": 171630,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "As the world watches the rapidly deteriorating situation in Ukraine, President Volodymyr Zelensky has rejected a US offer to evacuate him and his family from Kyiv, saying he needs anti-tank missiles, not a ride.\n\"I don't need a ride out of here,\" Zelensky told reporters at a press conference in Kyiv on Thursday. \"I need anti-tank missiles.\"\nZelensky's comments come as US Secretary of State Antony Blinken arrived in Kyiv to meet with Ukrainian officials and offer support for the country's fight against Russian aggression.\nBlinken said that the US was prepared to provide military aid to Ukraine, including Javelin anti-tank missiles, which have been used by Ukrainian forces to devastating effect in previous conflicts with Russia.\nBut Zelensky made it clear that he is not interested",
        "title": "Rejecting US evacuation offer, Zelensky says I need anti-tank ammo, 'not a ride'",
        "total_awards_received": 0,
        "upvote_ratio": 0.94,
        "url": "https://www.timesofisrael.com/liveblog-february-25-2022/",
        "classification": "article"
    },
    "t1f287": {
        "author_fullname": "t2_a0o5d75c",
        "author_name": "o-Themis-o",
        "created_utc": 1645824577.0,
        "domain": "cybernews.com",
        "gilded": 10,
        "gildings": {},
        "id": "t1f287",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Russia/Ukraine",
        "media_only": false,
        "num_comments": 6372,
        "over_18": false,
        "permalink": "/r/worldnews/comments/t1f287/anonymous_leaks_database_of_the_russian_ministry/",
        "score": 165227,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "Yesterday, on June 17th, 2021, hacktivist group Anonymous leaked a massive database belonging to the Russian Ministry of Defence. The leak includes confidential information about military operations, weapons systems, and personnel data of thousands of Russian soldiers.\nThe database was reportedly stolen from the servers of the Main Directorate of the General Staff of the Armed Forces of Russia (GRU), which is responsible for conducting military intelligence and special operations. According to Anonymous, the leak exposes the \"true nature\" of the Russian military and its involvement in conflicts around the world.\nThe leaked data includes detailed information about the Russian military's operations in Ukraine, Syria, and other countries. It also reveals the identities of thousands of Russian soldiers who have been involved in these operations, including their names, ranks, and dates of birth.\nIn addition to this, the leak includes information about Russian military",
        "title": "Anonymous leaks database of the Russian Ministry of Defence",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://cybernews.com/news/anonymous-leaks-database-of-the-russian-ministry-of-defence/",
        "classification": "article"
    },
    "4d75i7": {
        "author_fullname": "t2_adhbp",
        "author_name": "mister_geaux",
        "created_utc": 1459706506.0,
        "domain": "panamapapers.sueddeutsche.de",
        "gilded": 10,
        "gildings": {},
        "id": "4d75i7",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "Panama Papers",
        "media_only": false,
        "num_comments": 12010,
        "over_18": false,
        "permalink": "/r/worldnews/comments/4d75i7/26_terabyte_leak_of_panamanian_shell_company_data/",
        "score": 154764,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "The Panama Papers, a massive leak of confidential documents from a Panamanian law firm, has revealed how wealthy individuals and corporations use offshore tax havens to avoid paying their fair share of taxes. The leaked files show that many high-profile individuals, including world leaders and celebrities, have been using complex financial structures to hide their assets and reduce their tax liabilities.\nMossack Fonseca, the Panamanian law firm at the center of the scandal, is one of the largest providers of offshore services in the world. The leaked documents consist of emails, contracts, and other confidential information that detail the actions of Mossack Fonseca's clients, which include some of the wealthiest people on Earth.\nThe International Consortium of Investigative Journalists (ICIJ), a group of reporters who analyzed the leaked documents, found evidence of w",
        "title": "2.6 terabyte leak of Panamanian shell company data reveals \"how a global industry led by major banks, legal firms, and asset management companies secretly manages the estates of politicians, Fifa officials, fraudsters and drug smugglers, celebrities and professional athletes.\"",
        "total_awards_received": 0,
        "upvote_ratio": 0.95,
        "url": "http://panamapapers.sueddeutsche.de/articles/56febff0a1bb8d3c3495adf4/",
        "classification": "article"
    },
    "t20u4i": {
        "author_fullname": "t2_90ek09bb",
        "author_name": "Sodoff_Baldrick_",
        "created_utc": 1645892658.0,
        "domain": "uawire.org",
        "gilded": 3,
        "gildings": {},
        "id": "t20u4i",
        "is_created_from_ads_ui": false,
        "is_original_content": false,
        "is_reddit_media_domain": false,
        "is_self": false,
        "is_video": false,
        "link_flair_text": "404 not found right now, probably hugged to death",
        "media_only": false,
        "num_comments": 6837,
        "over_18": false,
        "permalink": "/r/worldnews/comments/t20u4i/kyiv_full_consensus_for_disconnecting_russia_from/",
        "score": 152122,
        "subreddit": "worldnews",
        "subreddit_id": "2qh13",
        "text": "Kyiv has confirmed that it has reached a full consensus with its international partners to disconnect Russia from the SWIFT payment system, which is used by financial institutions worldwide to send and receive information about financial transactions.\n\"The process of disconnecting Russia from the SWIFT system has begun. The relevant decision was made at the highest level. The process will be completed in the coming days,\" Ukrainian Foreign Minister Vadym Prystaiko said on Tuesday during a press conference in Kyiv.\nAccording to Prystaiko, this step is part of Ukraine's efforts to counter Russian aggression and is aimed at limiting Moscow's ability to finance its military operations in eastern Ukraine and occupation of Crimea.\n\"This is a very significant step, because it will hit Putin where it hurts most – in his pocket. This will significantly reduce the flow of money into the Russian budget, which is used to",
        "title": "Kyiv: full consensus for disconnecting Russia from SWIFT has been achieved, the process has begun",
        "total_awards_received": 0,
        "upvote_ratio": 0.93,
        "url": "https://www.uawire.org/kyiv-full-consensus-for-disconnecting-russia-from-swift-has-been-achieved-the-process-has-begun",
        "classification": "article"
    }
}